{
  "user_stories": [
    {
      "id": "US-CA-001",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Ver métricas como mensajes enviados, tasa de respuesta de clientes, recordatorios automáticos activos y clientes con comunicación pendiente",
      "reason": "Entender cómo está funcionando mi comunicación con los clientes y qué necesito mejorar",
      "description": "Reemplazar métricas genéricas de marketing (campañas activas, ingresos atribuidos) por métricas específicas de comunicación entre entrenador y clientes que muestren el estado real de la interacción."
    },
    {
      "id": "US-CA-002",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Configurar recordatorios automáticos que se envíen por WhatsApp o SMS antes de cada sesión (24h, 2h antes)",
      "reason": "Reducir las ausencias y asegurarme de que los clientes lleguen puntuales sin tener que recordarles manualmente",
      "description": "Sistema para crear plantillas de recordatorios de sesiones que se envíen automáticamente según el calendario de reservas, con personalización por cliente y posibilidad de activar/desactivar por cliente."
    },
    {
      "id": "US-CA-003",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Crear una secuencia automática de mensajes de bienvenida que se active cuando un lead se convierte en cliente",
      "reason": "Dar una excelente primera impresión y proporcionar información importante sin tener que escribir los mismos mensajes repetidamente",
      "description": "Sistema de secuencias de bienvenida con múltiples mensajes programados (día 1: bienvenida, día 2: qué esperar, día 3: preparación primera sesión) que se envíen automáticamente por email o WhatsApp."
    },
    {
      "id": "US-CA-004",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Automatizar el seguimiento cuando un cliente falta a una sesión sin avisar",
      "reason": "Mostrar que me importa su progreso y recuperar la sesión sin tener que contactar manualmente a cada uno",
      "description": "Automatización que detecte ausencias no justificadas y envíe mensajes personalizados preguntando si todo está bien y ofreciendo reagendar, con diferentes tonos según la frecuencia de ausencias."
    },
    {
      "id": "US-CA-005",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Tener plantillas predefinidas para situaciones como confirmar sesión, recordar pago pendiente, felicitar por progreso o sugerir ajuste de plan",
      "reason": "Ahorrar tiempo escribiendo mensajes similares y mantener consistencia en la comunicación",
      "description": "Biblioteca de plantillas de mensajes personalizables con variables (nombre cliente, fecha sesión, etc.) que pueda usar desde cualquier conversación o enviar en masa a grupos de clientes."
    },
    {
      "id": "US-CA-006",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Programar mensajes automáticos que se envíen cada 2 semanas o 1 mes preguntando por el progreso y cómo se sienten los clientes",
      "reason": "Mantener el engagement y detectar problemas antes de que se conviertan en abandono",
      "description": "Sistema de mensajes programados que se envíen automáticamente según la frecuencia configurada, con opción de personalizar el contenido y ajustar la frecuencia por cliente o grupo de clientes."
    },
    {
      "id": "US-CA-007",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Configurar una secuencia automática que se active cuando un cliente no viene a sesiones durante X días",
      "reason": "Recuperar clientes que están perdiendo el hábito antes de que abandonen completamente",
      "description": "Automatización que detecte inactividad (sin sesiones en X días) y envíe una secuencia progresiva de mensajes motivacionales, ofertas especiales o invitaciones a retomar, con posibilidad de pausar si el cliente responde."
    },
    {
      "id": "US-CA-008",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Enviar automáticamente mensajes de felicitación en cumpleaños y aniversarios de inicio de entrenamiento",
      "reason": "Fortalecer la relación personal con los clientes y hacerlos sentir valorados",
      "description": "Sistema que detecte fechas importantes de cada cliente y envíe mensajes personalizados automáticamente, con posibilidad de incluir ofertas especiales o recordatorios de sesiones."
    },
    {
      "id": "US-CA-009",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Enviar recordatorios automáticos cuando un pago está próximo a vencer o vencido",
      "reason": "Reducir la morosidad sin tener que estar pendiente manualmente de cada cliente",
      "description": "Automatización que detecte pagos pendientes o próximos a vencer y envíe recordatorios amables por WhatsApp o email, con diferentes mensajes según los días de retraso."
    },
    {
      "id": "US-CA-010",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Ver un resumen de todos los mensajes automáticos enviados, tasas de apertura, respuestas y efectividad",
      "reason": "Entender qué mensajes funcionan mejor y optimizar mi comunicación",
      "description": "Dashboard que muestre estadísticas de mensajes automáticos: cuántos se enviaron, cuántos se abrieron, cuántos generaron respuesta, y comparativa entre diferentes tipos de mensajes."
    },
    {
      "id": "US-CA-011",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Agrupar clientes por criterios y enviarles mensajes específicos",
      "reason": "Personalizar la comunicación según el estado y necesidades de cada grupo sin enviar mensajes genéricos a todos",
      "description": "Sistema de segmentación que permita crear grupos de clientes según criterios (días desde última sesión, tipo de plan, adherencia, etc.) y enviar mensajes masivos personalizados a cada segmento."
    },
    {
      "id": "US-CA-012",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Crear y programar envío de newsletters con consejos, novedades, retos o contenido educativo",
      "reason": "Mantener a los clientes informados y comprometidos sin tener que contactarlos individualmente",
      "description": "Editor de newsletters con plantillas, posibilidad de programar envío recurrente (semanal, quincenal, mensual) y tracking de aperturas y clics para medir engagement."
    },
    {
      "id": "US-CA-013",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Configurar mensajes automáticos que se envíen cuando recibo mensajes fuera de mi horario de atención",
      "reason": "Informar a los clientes cuándo responderé y gestionar expectativas sin tener que estar disponible 24/7",
      "description": "Sistema de respuestas automáticas que detecte mensajes entrantes fuera del horario configurado y envíe una respuesta automática informando el horario de atención y tiempo estimado de respuesta."
    },
    {
      "id": "US-CA-014",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Crear y enviar campañas promocionales como descuento en bonos, promoción de verano o invitación a clase grupal",
      "reason": "Aumentar ventas y engagement sin tener que contactar a cada cliente manualmente",
      "description": "Sistema para crear campañas promocionales con mensajes personalizados, seleccionar destinatarios (todos, segmentos específicos, clientes inactivos), programar envío y medir resultados."
    },
    {
      "id": "US-CA-015",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Sincronizar los mensajes automáticos con el sistema de reservas",
      "reason": "Que la comunicación esté sincronizada automáticamente con las acciones de los clientes sin tener que configurarlo manualmente",
      "description": "Integración que conecte las automatizaciones con el sistema de reservas para que los mensajes se activen según cambios en el calendario (nueva sesión → recordatorio, cancelación → seguimiento, etc.)."
    },
    {
      "id": "US-CA-016",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Ver en un solo lugar todas mis automatizaciones con su estado y poder activarlas o pausarlas fácilmente",
      "reason": "Tener control total sobre mi comunicación automatizada sin tener que buscar en diferentes secciones",
      "description": "Panel centralizado que muestre todas las automatizaciones configuradas, su estado (activa, pausada, finalizada), próximos envíos programados y permita gestionarlas desde un único lugar."
    },
    {
      "id": "US-CA-017",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Recibir notificaciones cuando un cliente no responde a mensajes críticos como recordatorios de pago o seguimiento de ausencias",
      "reason": "Poder contactarlo de forma más directa o personal antes de que la situación empeore",
      "description": "Sistema de alertas que detecte cuando mensajes importantes no han sido abiertos o respondidos después de X tiempo y notifique al entrenador para que tome acción manual."
    },
    {
      "id": "US-CA-018",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Configurar horarios de envío preferidos por cliente o grupo",
      "reason": "Aumentar las tasas de apertura y no molestar a los clientes con mensajes a horas inadecuadas",
      "description": "Sistema que permita configurar horarios de envío preferidos por cliente o grupo, y que los mensajes automáticos se programen dentro de esas ventanas de tiempo."
    },
    {
      "id": "US-CA-019",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Configurar una secuencia completa de onboarding con múltiples pasos y lógica condicional",
      "reason": "Asegurar que los nuevos clientes tengan toda la información necesaria y se sientan bienvenidos desde el inicio",
      "description": "Constructor de secuencias de múltiples pasos con lógica condicional (si responde X, enviar Y), delays entre mensajes, y posibilidad de pausar si el cliente responde o toma acción."
    },
    {
      "id": "US-CA-020",
      "feature": "src/features/CampanasAutomatizacion",
      "persona": "Entrenador personal",
      "goal": "Exportar reportes con estadísticas de mensajes enviados, tasas de respuesta, efectividad de automatizaciones y costos",
      "reason": "Analizar el ROI de mi tiempo invertido en comunicación y presentar resultados si es necesario",
      "description": "Funcionalidad de exportación de reportes en diferentes formatos (PDF, Excel) que incluya métricas de comunicación, comparativas de períodos, y análisis de efectividad de cada tipo de automatización."
    },
    {
      "id": "US-02",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Solicitar un testimonio directamente desde el perfil de un cliente",
      "reason": "Recopilar testimonios de forma rápida y contextual cuando el cliente está satisfecho",
      "description": "Botón en el perfil del cliente para solicitar testimonio con mensaje predefinido personalizable, que se envía por WhatsApp o email. Seguimiento del estado (pendiente, recibido, publicado)."
    },
    {
      "id": "US-03",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Usar plantillas de mensajes para solicitar testimonios",
      "reason": "Ahorrar tiempo y mantener un tono profesional consistente",
      "description": "Plantillas predefinidas para diferentes momentos: después de alcanzar un objetivo, al completar un programa, después de X sesiones. Posibilidad de personalizar antes de enviar."
    },
    {
      "id": "US-04",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Recibir testimonios por WhatsApp, email, formulario web o redes sociales",
      "reason": "Facilitar que mis clientes compartan su experiencia en el canal que prefieran",
      "description": "Sistema que acepta testimonios desde múltiples fuentes: link de formulario, WhatsApp, email, captura manual, importación desde Google Reviews o redes sociales. Todos se centralizan en un solo lugar."
    },
    {
      "id": "US-05",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Tener una biblioteca organizada de todos mis testimonios con filtros",
      "reason": "Encontrar rápidamente testimonios relevantes para usar en marketing o redes sociales",
      "description": "Vista de todos los testimonios con filtros por cliente, fecha, tipo (texto, video, audio), puntuación, y etiquetas. Búsqueda por palabras clave. Vista de testimonio individual con opción de editar, aprobar para publicación, o rechazar."
    },
    {
      "id": "US-06",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Compartir testimonios directamente en mis redes sociales",
      "reason": "Generar contenido de marketing auténtico sin esfuerzo adicional",
      "description": "Botón para compartir testimonio en Instagram, Facebook, Twitter, o copiar como texto/listo para pegar. Opción de generar imagen con diseño atractivo incluyendo foto del cliente (si autorizada), nombre, testimonio y mi marca."
    },
    {
      "id": "US-07",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Exportar testimonios en formato JSON, CSV o código HTML",
      "reason": "Usarlos en mi página web, landing pages, o materiales de marketing",
      "description": "Opción de exportar testimonios seleccionados o todos, en diferentes formatos. Incluir datos relevantes: nombre, testimonio, puntuación, fecha, foto (si disponible). Código HTML listo para insertar en web."
    },
    {
      "id": "US-08",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Recibir recordatorios cuando pedir testimonios a clientes satisfechos",
      "reason": "No olvidarme de recopilar testimonios en los momentos óptimos",
      "description": "Sistema que detecta momentos ideales (cliente alcanza objetivo, completa programa, da feedback positivo, cumple X sesiones) y sugiere solicitar testimonio. Notificación in-app y opción de enviar recordatorio automático al cliente."
    },
    {
      "id": "US-09",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Enviar automáticamente una encuesta corta después de cada sesión",
      "reason": "Obtener feedback inmediato y detectar problemas a tiempo",
      "description": "Encuesta automática que se envía 2-4 horas después de cada sesión por WhatsApp o email. Pregunta simple de satisfacción (1-5 estrellas) y opcional comentario. Resultados se muestran en dashboard y alerta si hay feedback negativo."
    },
    {
      "id": "US-10",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Crear encuestas usando plantillas predefinidas para entrenadores personales",
      "reason": "Recopilar feedback estructurado sin complicaciones",
      "description": "Plantillas listas para usar: satisfacción post-sesión, progreso mensual, satisfacción con programa, NPS trimestral. Solo seleccionar plantilla, elegir clientes, y enviar. Personalización opcional de preguntas."
    },
    {
      "id": "US-11",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Recibir alertas inmediatas cuando un cliente da feedback negativo",
      "reason": "Poder actuar rápidamente y evitar que el cliente se vaya",
      "description": "Notificación urgente (in-app, email, WhatsApp) cuando un cliente da puntuación baja (<3 estrellas) o comentario negativo. Mostrar historial del cliente, últimas sesiones, y sugerencias de acción. Botón rápido para contactar al cliente."
    },
    {
      "id": "US-12",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Usar plantillas de respuesta para abordar feedback negativo",
      "reason": "Responder de forma profesional y constructiva rápidamente",
      "description": "Plantillas de mensajes para diferentes tipos de feedback negativo: insatisfacción con sesión, progreso lento, problemas de comunicación, etc. Personalizables antes de enviar. Sugerencias de próximos pasos según el tipo de problema."
    },
    {
      "id": "US-13",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Ver el historial completo de feedback de cada cliente",
      "reason": "Identificar tendencias, mejoras o problemas recurrentes",
      "description": "Sección en el perfil del cliente mostrando todos los feedbacks y testimonios históricos: fechas, puntuaciones, comentarios, tendencia (mejorando/empeorando). Gráfico de evolución de satisfacción a lo largo del tiempo."
    },
    {
      "id": "US-14",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Identificar automáticamente clientes promotores",
      "reason": "Poder pedirles referidos y testimonios de forma estratégica",
      "description": "Sistema que identifica clientes promotores basado en: alta satisfacción consistente, asistencia regular, cumplimiento de objetivos, feedback positivo. Lista de promotores con sugerencias de cuándo pedir referido o testimonio."
    },
    {
      "id": "US-15",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Gestionar un programa de referidos donde clientes satisfechos me traen nuevos clientes",
      "reason": "Crecer mi negocio de forma orgánica y recompensar a clientes leales",
      "description": "Sistema para crear programa de referidos: definir recompensa (descuento, sesión gratis, etc.), generar link único por cliente, trackear referidos, gestionar recompensas. Dashboard con estadísticas de referidos y clientes que más refieren."
    },
    {
      "id": "US-16",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Ver métricas de retención y satisfacción calculadas con datos reales de mis clientes",
      "reason": "Tener información precisa sobre la salud de mi negocio",
      "description": "Métricas calculadas automáticamente: tasa de retención, satisfacción promedio, NPS, clientes en riesgo, clientes promotores. Todo basado en datos reales: sesiones, feedback, asistencia, pagos. Comparativas con periodos anteriores."
    },
    {
      "id": "US-18",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Ver un listado de solicitudes de testimonios pendientes",
      "reason": "Hacer seguimiento y recordar a clientes que no han respondido",
      "description": "Vista de todas las solicitudes de testimonios: enviadas, pendientes, recibidas, rechazadas. Filtros por estado y fecha. Opción de reenviar recordatorio o cancelar solicitud. Notificación cuando se recibe respuesta."
    },
    {
      "id": "US-19",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Importar testimonios desde Google Reviews y otras plataformas",
      "reason": "Centralizar todos mis testimonios en un solo lugar",
      "description": "Conectar con Google My Business, Facebook, Instagram para importar reseñas automáticamente. Sincronización periódica. Opción de solicitar que clientes dejen reseña en estas plataformas directamente desde la app."
    },
    {
      "id": "US-20",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Recibir un reporte mensual automático con métricas de satisfacción y fidelización",
      "reason": "Hacer seguimiento de mi progreso y identificar áreas de mejora",
      "description": "Reporte PDF/email mensual con: satisfacción promedio, testimonios recopilados, clientes promotores, feedback negativo resuelto, tendencias, comparativa con mes anterior. Envío automático el primer día de cada mes. Opción de descargar desde dashboard."
    },
    {
      "id": "US-21",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Sistema que acepta testimonios desde múltiples fuentes: link de formulario, WhatsApp, email, captura manual, importación desde Google Reviews o redes sociales. Todos se centralizan en un solo lugar",
      "reason": "Facilitar que mis clientes compartan su experiencia en el canal que prefieran y centralizar todos los testimonios en un único lugar",
      "description": "Sistema que acepta testimonios desde múltiples fuentes: link de formulario, WhatsApp, email, captura manual, importación desde Google Reviews o redes sociales. Todos se centralizan en un solo lugar."
    },
    {
      "id": "US-22",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Vista de todos los testimonios con filtros por cliente, fecha, tipo (texto, video, audio), puntuación, y etiquetas. Búsqueda por palabras clave. Vista de testimonio individual con opción de editar, aprobar para publicación, o rechazar",
      "reason": "Encontrar rápidamente testimonios relevantes para usar en marketing o redes sociales y gestionar su estado de publicación",
      "description": "Vista de todos los testimonios con filtros por cliente, fecha, tipo (texto, video, audio), puntuación, y etiquetas. Búsqueda por palabras clave. Vista de testimonio individual con opción de editar, aprobar para publicación, o rechazar."
    },
    {
      "id": "US-CSS-001",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Ver métricas específicas como leads generados desde redes sociales, consultas recibidas por contenido publicado, y tasa de conversión de contenido a clientes",
      "reason": "Entender qué tipo de contenido realmente me ayuda a conseguir nuevos clientes y optimizar mi estrategia de marketing",
      "description": "Reemplazar métricas genéricas de marketing por métricas específicas para entrenadores: leads generados, consultas agendadas desde contenido, clientes convertidos desde redes sociales, y engagement que se traduce en negocio real."
    },
    {
      "id": "US-CSS-002",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Que la IA genere ideas de contenido basándose en los programas de entrenamiento que tengo creados y asignados a clientes",
      "reason": "Crear contenido educativo relevante que muestre mi expertise y ayude a educar tanto a clientes actuales como a potenciales clientes",
      "description": "Integración con programas de entrenamiento para que la IA sugiera contenido como \"Ejercicio del mes: Sentadilla profunda\" basado en ejercicios que enseño, o \"Beneficios del entrenamiento funcional\" si tengo programas funcionales activos."
    },
    {
      "id": "US-CSS-003",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Tener plantillas predefinidas para tipos de contenido comunes como consejo de ejercicio, transformación de cliente, mito vs realidad, rutina rápida o motivación diaria",
      "reason": "Ahorrar tiempo creando contenido y mantener consistencia en mi marca personal",
      "description": "Biblioteca de plantillas de contenido específicas para fitness con estructuras predefinidas (formato, hooks, CTAs) que pueda personalizar rápidamente según el tema que quiera tratar."
    },
    {
      "id": "US-CSS-004",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Programar automáticamente mis publicaciones en los horarios donde mi audiencia está más activa",
      "reason": "Maximizar el alcance y engagement sin tener que estar pendiente de publicar manualmente",
      "description": "Sistema que analice el mejor momento para publicar según mi audiencia (mañana temprano para motivación, tarde para tips, fin de semana para transformaciones) y programe automáticamente el contenido en esos horarios."
    },
    {
      "id": "US-CSS-005",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Crear fácilmente contenido destacando los logros y transformaciones de mis clientes con su permiso",
      "reason": "Generar contenido social proof que demuestre resultados reales y atraiga nuevos clientes",
      "description": "Herramienta que me permita seleccionar un cliente, ver sus métricas de progreso (peso, medidas, fotos antes/después si autoriza), y generar automáticamente un post destacando su logro con plantillas profesionales y solicitud de permiso integrada."
    },
    {
      "id": "US-CSS-006",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Que la IA analice las preguntas más frecuentes que recibo de clientes y genere ideas de contenido educativo para responderlas",
      "reason": "Crear contenido valioso que resuelva dudas comunes y posicionarme como experto",
      "description": "Integración con inbox/mensajes para identificar preguntas frecuentes y generar ideas de contenido (posts, reels, carruseles) que respondan esas dudas de forma educativa y atractiva."
    },
    {
      "id": "US-CSS-007",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Sistema que me permita crear secuencias de contenido (día 1: introducción, día 3: valor educativo, día 5: testimonial, día 7: CTA a consulta) que se publiquen automáticamente y se integren con mis embudos de captación",
      "reason": "Automatizar mi estrategia de marketing y convertir más leads en clientes sin tener que publicar manualmente cada contenido en el momento adecuado",
      "description": "Sistema completo de secuencias de contenido automatizadas dentro del módulo ContentSocialStudio que permita: 1) Crear plantillas de secuencias con múltiples posts programados en días específicos (día 1: introducción y presentación, día 3: contenido de valor educativo, día 5: testimonial de cliente, día 7: CTA a consulta), 2) Configurar la publicación automática de cada post en la secuencia según el calendario definido, 3) Integración directa con los embudos de captación para que cuando un lead entre a un embudo específico, se active automáticamente la secuencia correspondiente, 4) Personalización de cada post en la secuencia con hooks, copy, imágenes y CTAs específicos, 5) Tracking de qué leads han visto cada post de la secuencia y su tasa de conversión a consulta, 6) Posibilidad de pausar, modificar o duplicar secuencias existentes. El sistema debe estar integrado con el Planner de Redes Sociales para la programación automática y con FunnelsAdquisicion para la activación basada en embudos."
    },
    {
      "id": "US-CSS-008",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Biblioteca mejorada con categorías específicas (ejercicios, tips nutricionales, motivación, técnica) donde pueda guardar clips, organizarlos por tema, y reutilizarlos fácilmente en nuevas publicaciones con diferentes hooks o CTAs",
      "reason": "Ahorrar tiempo creando contenido nuevo y tener material listo para publicar cuando lo necesite, reutilizando clips existentes con diferentes enfoques y mensajes",
      "description": "Sistema de biblioteca mejorada dentro del módulo ContentSocialStudio (Content Clipper) que incluya: 1) Categorías específicas predefinidas: ejercicios (con subcategorías por tipo de ejercicio, grupo muscular, nivel de dificultad), tips nutricionales (macronutrientes, recetas, suplementación), motivación (frases, transformaciones, logros), y técnica (formas correctas, errores comunes, progresiones), 2) Sistema de etiquetas y tags para organización flexible y búsqueda avanzada, 3) Guardado de clips en múltiples formatos (video, imagen, texto, audio) con metadatos (duración, fecha, descripción, notas), 4) Funcionalidad de reutilización rápida: seleccionar un clip de la biblioteca y aplicarle diferentes hooks (introducciones), CTAs (llamados a la acción), y contextos para crear nuevas publicaciones sin tener que recrear el contenido base, 5) Vista de biblioteca con filtros por categoría, tags, fecha, tipo de contenido y búsqueda por palabras clave, 6) Integración con el editor de contenido para arrastrar y soltar clips desde la biblioteca directamente a nuevas publicaciones, 7) Historial de uso mostrando en qué publicaciones se ha utilizado cada clip, 8) Sistema de favoritos y clips destacados para acceso rápido a contenido más usado. La biblioteca debe estar integrada con el Planner para sugerir clips relevantes al crear contenido y con el generador de secuencias para reutilizar clips en múltiples posts."
    },
    {
      "id": "US-CSS-009",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Configurar mi voz personal (tono, especialización, valores) y que la IA genere copy coherente con mi estilo",
      "reason": "Mantener autenticidad en mi contenido mientras ahorro tiempo escribiendo",
      "description": "Configuración de perfil de marca personal donde defina mi especialización (hipertrofia, pérdida de peso, rehabilitación, etc.), tono (motivacional, técnico, cercano), y valores, para que la IA genere copy que suene como yo. El sistema debe permitir configurar múltiples especializaciones, seleccionar el tono de voz preferido, definir valores clave de la marca, y guardar esta configuración para que todas las generaciones de IA se adapten automáticamente a este perfil."
    },
    {
      "id": "US-CSS-010",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Crear y programar contenido que promocione mis servicios, planes disponibles y ofertas especiales de forma natural",
      "reason": "Generar ventas sin sonar demasiado comercial o agresivo",
      "description": "Plantillas y herramientas para crear contenido promocional que se integre con mis servicios (mostrar planes disponibles, ofertas, bonos) de forma educativa y atractiva, programado estratégicamente en el calendario. El sistema debe incluir plantillas predefinidas para promocionar planes de entrenamiento, ofertas especiales, bonos de sesiones, y nuevos servicios, con integración directa con el calendario del Planner de Redes Sociales para programar el contenido en los momentos más estratégicos. Las plantillas deben ser educativas y atractivas, evitando un tono excesivamente comercial."
    },
    {
      "id": "US-CSS-011",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Ver analytics que me muestren qué contenido específico generó consultas agendadas o leads",
      "reason": "Entender qué funciona mejor y crear más contenido similar que me traiga clientes",
      "description": "Dashboard de analytics que muestre qué posts, reels o stories generaron leads reales (consultas agendadas, mensajes de interés), permitiéndome identificar patrones y duplicar contenido exitoso."
    },
    {
      "id": "US-CSS-012",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Generar ideas de contenido educativo y motivacional dirigido específicamente a mis clientes actuales",
      "reason": "Mantenerlos comprometidos, educados y motivados entre sesiones, reduciendo abandono",
      "description": "Sistema que genere ideas de contenido interno (tips de nutrición, ejercicios complementarios, motivación) que pueda compartir directamente con mis clientes o publicar en redes para mantenerlos comprometidos."
    },
    {
      "id": "US-CSS-013",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Que el sistema sugiera contenido relacionado con los temas que trataré en próximas sesiones con clientes",
      "reason": "Preparar a mis clientes y crear contenido relevante basado en mi actividad real",
      "description": "Integración con agenda dentro del módulo ContentSocialStudio que incluya: 1) Conexión automática con el sistema de agenda/calendario para analizar próximas sesiones programadas, 2) Análisis inteligente de los temas, ejercicios o técnicas que se tratarán en cada sesión (ej: si tengo sesión de técnica de sentadilla, identificar 'sentadilla' como tema clave), 3) Generación automática de sugerencias de contenido relacionado (posts, reels, carruseles) basadas en los temas identificados de las próximas sesiones, 4) Sugerencias de timing óptimo para publicar: contenido educativo antes de la sesión (para preparar al cliente) o contenido de refuerzo después de la sesión (para consolidar el aprendizaje), 5) Integración con el Planner de Redes Sociales para programar automáticamente el contenido sugerido en las fechas recomendadas, 6) Personalización de sugerencias según el tipo de sesión (técnica, fuerza, cardio, rehabilitación) y el nivel del cliente, 7) Notificaciones cuando hay sesiones próximas sin contenido relacionado programado, 8) Vista de calendario que muestre las sesiones programadas junto con el contenido sugerido y programado relacionado. El sistema debe estar integrado con el módulo de agenda/calendario para acceder a la información de sesiones y con el Planner para la programación automática de contenido."
    },
    {
      "id": "US-CSS-014",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Seleccionar un ejercicio de mi biblioteca y generar rápidamente un reel o video corto educativo sobre ese ejercicio",
      "reason": "Crear contenido de valor sin tener que grabar y editar desde cero cada vez",
      "description": "Herramienta de generación rápida de video/reel dentro del módulo ContentSocialStudio que incluya: 1) Integración con la biblioteca de ejercicios para seleccionar cualquier ejercicio disponible (con acceso a videos, imágenes, descripciones y metadatos del ejercicio), 2) Editor de contenido que permita añadir un hook personalizado (texto introductorio que capture la atención), tips clave editables (puntos importantes sobre técnica, beneficios, errores comunes), y descripción del ejercicio, 3) Sistema de plantillas visuales profesionales predefinidas para diferentes tipos de ejercicios (fuerza, cardio, flexibilidad, técnica) con diseños modernos y atractivos, 4) Generación automática de formato de video/reel optimizado para redes sociales (Instagram Reels, TikTok, YouTube Shorts) con dimensiones y duración adecuadas, 5) Personalización visual: selección de colores, fuentes, animaciones, transiciones y elementos gráficos que coincidan con la marca personal del entrenador, 6) Integración con assets multimedia: posibilidad de usar videos existentes del ejercicio, imágenes, gráficos de músculos trabajados, y elementos visuales de la biblioteca, 7) Preview en tiempo real del video/reel generado antes de finalizar, 8) Exportación directa al Planner de Redes Sociales para programar la publicación, 9) Opción de guardar como plantilla reutilizable para ejercicios similares, 10) Generación automática de copy para el post (descripción, hashtags sugeridos, CTA) que acompañe al video. La herramienta debe estar integrada con Content Clipper para acceder a la biblioteca de ejercicios, con Video Studio para el procesamiento de video, y con el Planner para la programación de publicación."
    },
    {
      "id": "US-CSS-016",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Recibir sugerencias de contenido basadas en tendencias actuales de fitness filtradas por mi especialización y audiencia, adaptadas con mi propio ángulo y expertise",
      "reason": "Mantenerme relevante y crear contenido que resuene con mi audiencia mientras mantengo mi voz única y posicionamiento como experto",
      "description": "Sistema de análisis de tendencias de fitness dentro del módulo ContentSocialStudio que incluya: 1) Monitoreo automático de tendencias de fitness en redes sociales (Instagram, TikTok, YouTube, Twitter) identificando temas emergentes, hashtags populares, formatos virales y contenido de alto engagement, 2) Filtrado inteligente según especialización del entrenador (hipertrofia, pérdida de peso, rehabilitación, entrenamiento funcional, etc.) para mostrar solo tendencias relevantes, 3) Análisis de audiencia para filtrar tendencias según el perfil demográfico, intereses y comportamiento de la audiencia del entrenador, 4) Generación de ideas de contenido adaptadas que tomen la tendencia detectada y la adapten con el ángulo único, expertise y voz personal del entrenador, 5) Sugerencias de formatos óptimos para cada tendencia (reels, carruseles, posts, stories) basadas en el rendimiento histórico, 6) Integración con el Perfil de Marca para que todas las sugerencias mantengan coherencia con el tono, valores y especialización configurados, 7) Sistema de priorización que muestre tendencias más relevantes primero según especialización, audiencia y potencial de engagement, 8) Vista de tendencias con contexto: explicación de por qué es relevante, ejemplos de contenido exitoso, y sugerencias de cómo adaptarlo, 9) Notificaciones cuando surgen tendencias altamente relevantes para la especialización del entrenador, 10) Historial de tendencias analizadas y contenido generado a partir de ellas para tracking de efectividad. El sistema debe estar integrado con el Generador de Ideas IA para convertir tendencias en contenido accionable, con el Planner de Redes Sociales para programar contenido basado en tendencias, y con el Perfil de Marca para mantener coherencia en todas las sugerencias."
    },
    {
      "id": "US-CSS-017",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Crear carruseles educativos de forma rápida usando plantillas predefinidas que pueda personalizar fácilmente con mis propios ejercicios, conocimiento y expertise",
      "reason": "Crear contenido educativo de alto valor que se comparta mucho, posicione mi expertise y ahorre tiempo en diseño, manteniendo mi voz única y conocimiento especializado",
      "description": "Editor especializado de carruseles dentro del módulo ContentSocialStudio que incluya: 1) Biblioteca de plantillas predefinidas específicas para fitness: rutina de 5 ejercicios (con slots para nombre, descripción, imagen/video, músculos trabajados, series y repeticiones), 7 mitos del fitness (con estructura mito vs realidad, explicación científica, y conclusión), 10 tips de nutrición (con tip, explicación breve, y aplicación práctica), rutina de 7 días, 5 errores comunes, progresión de ejercicios, y más, 2) Editor visual drag-and-drop que permita personalizar cada slide del carrusel: texto, imágenes, videos, colores, fuentes, y diseño manteniendo la estructura de la plantilla, 3) Integración con la biblioteca de ejercicios para arrastrar y soltar ejercicios directamente a las plantillas de rutinas, incluyendo imágenes, videos, descripciones y metadatos, 4) Personalización de contenido: reemplazar ejercicios predefinidos con ejercicios propios, modificar tips con conocimiento personal, adaptar mitos según especialización, 5) Sistema de diseño coherente: paleta de colores, fuentes y estilo visual que se adapte automáticamente al Perfil de Marca del entrenador, 6) Preview en tiempo real del carrusel completo antes de finalizar, mostrando cómo se verá en Instagram, Facebook u otras plataformas, 7) Optimización automática de dimensiones y formato para cada plataforma (Instagram carousel, Facebook post, LinkedIn carousel), 8) Generación automática de copy para el post (descripción, hashtags sugeridos, CTA) que acompañe al carrusel, 9) Guardado de carruseles personalizados como nuevas plantillas reutilizables para uso futuro, 10) Exportación directa al Planner de Redes Sociales para programar la publicación, 11) Plantillas adicionales: rutina de calentamiento, rutina de estiramiento, guía de suplementación, plan de alimentación semanal, y más según necesidades del entrenador, 12) Sistema de sugerencias que recomiende ejercicios, tips o mitos relevantes según la especialización y programas activos del entrenador. El editor debe estar integrado con Content Clipper para acceder a ejercicios y contenido multimedia, con el Perfil de Marca para mantener coherencia visual, y con el Planner para programación directa."
    },
    {
      "id": "US-CSS-018",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Crear y programar contenido temático para fechas importantes con antelación",
      "reason": "Estar preparado para momentos clave donde la gente busca entrenadores y maximizar oportunidades de captación",
      "description": "Calendario de contenido temático dentro del módulo ContentSocialStudio que incluya: 1) Calendario visual que muestre fechas importantes del año (Año Nuevo, Verano, Día de la Madre, Black Friday, Navidad, etc.) con indicadores de alta demanda para entrenadores, 2) Biblioteca de plantillas predefinidas específicas para cada fecha importante con estructuras de contenido, hooks, copy y CTAs adaptados al contexto (ej: plantilla 'Operación Verano' con contenido sobre preparación física, rutinas de playa, alimentación saludable), 3) Sugerencias automáticas de contenido basadas en la fecha y especialización del entrenador, generadas por IA y adaptadas a su voz de marca, 4) Sistema de programación anticipada que permita crear y programar contenido con semanas de antelación (configurar publicaciones 2-4 semanas antes de la fecha importante), 5) Vista de calendario mensual/anual que muestre todas las fechas importantes con contenido programado y sugerencias pendientes, 6) Plantillas personalizables para cada fecha: modificar copy, imágenes, CTAs y timing de publicación, 7) Integración con el Planner de Redes Sociales para programar automáticamente el contenido temático en los horarios óptimos, 8) Recordatorios y notificaciones cuando se acercan fechas importantes sin contenido programado, 9) Biblioteca de contenido histórico: ver qué contenido se publicó en fechas similares años anteriores y reutilizarlo o adaptarlo, 10) Métricas de rendimiento por fecha temática: ver qué contenido temático generó más engagement, leads y conversiones, 11) Sugerencias de secuencias de contenido: crear múltiples posts relacionados con una fecha importante que se publiquen en los días previos (ej: 7 días antes de Año Nuevo, publicar contenido sobre preparación de objetivos), 12) Categorización de fechas por tipo: temporadas (verano, invierno), festividades, eventos deportivos, y fechas relevantes para fitness. El sistema debe estar integrado con el Planner de Redes Sociales para la programación, con el Generador de Ideas IA para sugerencias personalizadas, y con el Perfil de Marca para mantener coherencia en el contenido temático."
    },
    {
      "id": "US-CSS-019",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Recibir un resumen semanal que muestre qué publiqué, cuánto engagement tuvo y cuántos leads o clientes generó",
      "reason": "Entender rápidamente el ROI de mi tiempo invertido en contenido y ajustar mi estrategia",
      "description": "Reporte semanal automatizado dentro del módulo ContentSocialStudio que incluya: 1) Consolidación de métricas de contenido: número de publicaciones realizadas (posts, reels, stories, carruseles), engagement total (likes, comentarios, compartidos, guardados), alcance e impresiones por plataforma (Instagram, Facebook, TikTok, etc.), y tasa de engagement promedio, 2) Métricas de resultados de negocio: leads generados desde contenido (consultas solicitadas, mensajes de interés, clics en CTAs), consultas agendadas atribuidas a contenido específico, conversiones de leads a clientes (primera sesión pagada, planes activos), y valor estimado de clientes generados, 3) Análisis de correlación: identificar qué contenido específico (posts, reels, temas) generó más leads y conversiones, mostrando el ROI de cada tipo de contenido, 4) Comparativa semanal: comparar métricas con la semana anterior para identificar tendencias (aumento/disminución de engagement, leads, conversiones), 5) Top contenido del período: destacar los 5-10 contenidos con mejor rendimiento en engagement y generación de leads, 6) Análisis por plataforma: desglose de métricas por red social mostrando cuál plataforma genera más engagement y leads, 7) Métricas de timing: análisis de qué días y horarios generaron más engagement y conversiones, 8) Resumen ejecutivo: sección destacada con los KPIs más importantes (total de leads generados, conversiones, engagement promedio, mejor contenido del período), 9) Formato de entrega: reporte disponible en dashboard in-app, envío automático por email cada lunes con resumen de la semana anterior, y opción de exportar en PDF o Excel, 10) Visualizaciones: gráficos de barras, líneas y tablas que muestren tendencias, comparativas y rankings de contenido, 11) Insights y recomendaciones: sugerencias automáticas basadas en los datos (ej: 'Tu contenido sobre X generó 3 leads, considera crear más contenido similar'), 12) Integración con Analytics de Leads: conexión directa con el sistema de tracking de leads para atribución precisa de consultas y conversiones a contenido específico, 13) Historial de reportes: acceso a reportes semanales anteriores para análisis de tendencias a largo plazo, 14) Alertas y notificaciones: notificación cuando hay cambios significativos en métricas (aumento/disminución de leads, engagement, etc.). El reporte debe estar integrado con el Planner de Redes Sociales para métricas de publicación, con Analytics de Leads para resultados de negocio, y con todas las plataformas de redes sociales conectadas para métricas de engagement y alcance."
    },
    {
      "id": "US-CSS-020",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Tomar un contenido exitoso y adaptarlo automáticamente para diferentes plataformas",
      "reason": "Maximizar el alcance de mi mejor contenido sin tener que recrearlo manualmente para cada plataforma",
      "description": "Herramienta de adaptación de contenido dentro del módulo ContentSocialStudio que incluya: 1) Selección de contenido exitoso desde la biblioteca o historial de publicaciones (identificado por alto engagement, leads generados, o conversiones), 2) Análisis automático del contenido original para extraer el mensaje clave, tono, elementos visuales y estructura, 3) Generación automática de versiones adaptadas para diferentes plataformas (Instagram Feed, Instagram Reels, Instagram Stories, Facebook Post, Facebook Video, TikTok, LinkedIn, Twitter, YouTube Shorts) optimizando formato, dimensiones, duración y estructura según las mejores prácticas de cada plataforma, 4) Adaptación inteligente de copy: ajuste automático de longitud de texto según límites de caracteres de cada plataforma, adaptación de hashtags, y optimización de CTAs para cada canal, 5) Adaptación de elementos visuales: recorte automático de imágenes/videos a dimensiones óptimas, ajuste de formato (cuadrado, vertical, horizontal) según plataforma, y optimización de calidad y tamaño de archivo, 6) Mantenimiento del mensaje central: preservación del hook principal, valor educativo, y llamada a la acción adaptada pero coherente, 7) Preview de todas las versiones generadas antes de aprobar, con posibilidad de editar manualmente cada versión, 8) Programación automática de todas las versiones adaptadas en el Planner de Redes Sociales en horarios óptimos para cada plataforma, 9) Tracking unificado: métricas consolidadas mostrando el rendimiento del contenido original y todas sus adaptaciones, 10) Sistema de aprendizaje: identificación de qué adaptaciones funcionan mejor en cada plataforma para mejorar futuras generaciones, 11) Plantillas de adaptación personalizables: guardar reglas de adaptación específicas por plataforma (ej: siempre convertir posts largos en carruseles para Instagram), 12) Integración con Content Clipper para guardar las versiones adaptadas como clips reutilizables. La herramienta debe estar integrada con el Planner de Redes Sociales para programación, con Analytics de Leads para identificar contenido exitoso, y con todas las plataformas conectadas para publicación directa."
    },
    {
      "id": "US-CSS-021",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Tener una biblioteca de plantillas de contenido específicas para fitness con estructuras predefinidas (formato, hooks, CTAs) que pueda personalizar rápidamente según el tema que quiera tratar",
      "reason": "Ahorrar tiempo creando contenido y mantener consistencia en mi marca personal mientras genero contenido de valor para mi audiencia",
      "description": "Biblioteca de plantillas de contenido específicas para fitness con estructuras predefinidas (formato, hooks, CTAs) que pueda personalizar rápidamente según el tema que quiera tratar. Las plantillas incluyen diferentes tipos de contenido como consejos de ejercicio, transformaciones de clientes, mitos vs realidad, rutinas rápidas, motivación diaria, tips nutricionales, y más. Cada plantilla tiene secciones editables para personalizar el mensaje manteniendo la estructura profesional y efectiva."
    },
    {
      "id": "US-CSS-022",
      "feature": "src/features/ContentSocialStudio",
      "persona": "Entrenador personal",
      "goal": "Tener un sistema que analice el mejor momento para publicar según mi audiencia (mañana temprano para motivación, tarde para tips, fin de semana para transformaciones) y programe automáticamente el contenido en esos horarios",
      "reason": "Maximizar el alcance y engagement sin tener que estar pendiente de publicar manualmente en los momentos óptimos",
      "description": "Sistema que analice el mejor momento para publicar según mi audiencia (mañana temprano para motivación, tarde para tips, fin de semana para transformaciones) y programe automáticamente el contenido en esos horarios. El sistema aprende de los patrones de engagement de mi audiencia y sugiere horarios óptimos según el tipo de contenido, día de la semana, y comportamiento histórico. Permite configurar reglas automáticas como 'publicar contenido motivacional entre 6-8am' o 'publicar transformaciones los fines de semana'."
    },
    {
      "id": "US-FA-001",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Ver métricas relevantes como consultas generadas, conversión de consulta a primera sesión, clientes nuevos del período y tasa de retención",
      "reason": "Entender cómo está funcionando mi estrategia de captación y qué canales me traen mejores clientes",
      "description": "Sistema de métricas específicas del negocio de entrenamiento personal dentro del módulo FunnelsAdquisicion que reemplace KPIs genéricos de marketing digital (ROAS, CTR emails) por métricas que muestren el flujo real desde consulta hasta cliente activo. El sistema debe incluir: 1) Métricas de captación inicial: consultas generadas (total y por canal), consultas agendadas, tasa de agendamiento (consultas agendadas / consultas generadas), tiempo promedio desde consulta hasta agendamiento, 2) Métricas de conversión a primera sesión: consultas realizadas, primera sesión pagada, tasa de conversión consulta → primera sesión, tiempo promedio desde consulta hasta primera sesión, valor promedio de primera sesión, 3) Métricas de conversión a cliente activo: clientes nuevos del período (definidos como clientes que compraron plan mensual, bono de sesiones, o segunda sesión), tasa de conversión primera sesión → cliente activo, tiempo promedio desde primera sesión hasta activación, valor promedio del cliente nuevo, 4) Métricas de retención: tasa de retención a 30, 60 y 90 días, clientes activos actuales, clientes en riesgo de abandono, tasa de reactivación de clientes inactivos, 5) Funnel visual completo: visualización del embudo desde consulta hasta cliente activo con tasas de conversión en cada etapa, identificación de cuellos de botella y oportunidades de mejora, 6) Métricas por canal de origen: desglose de todas las métricas anteriores por canal (Instagram, Facebook, Google, referidos, contenido orgánico, eventos, etc.) mostrando qué canales traen mejores clientes (mayor conversión, mayor retención, mayor valor), 7) Métricas de calidad del lead: tasa de no-show en consultas, tasa de cancelación de primera sesión, satisfacción promedio post-consulta, satisfacción promedio post-primera-sesión, 8) Comparativas temporales: comparación de métricas con períodos anteriores (semana, mes, trimestre) para identificar tendencias y mejoras, 9) Alertas y notificaciones: alertas cuando hay caídas significativas en tasas de conversión, aumento de no-shows, o cambios en calidad de leads por canal, 10) Dashboard consolidado: vista única que muestre todas estas métricas de forma clara y accionable, con gráficos y visualizaciones que faciliten la toma de decisiones, 11) Integración con datos reales: conexión con el sistema de agenda para consultas y sesiones, con el sistema de pagos para conversiones, y con el sistema de clientes para retención, 12) Exportación de reportes: posibilidad de exportar métricas en diferentes formatos para análisis externo o presentaciones. El sistema debe reemplazar completamente métricas genéricas como ROAS, CTR de emails, o impresiones por métricas que realmente importan para el negocio de entrenamiento personal."
    },
    {
      "id": "US-FA-002",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Ver y gestionar funnels específicos como consulta gratuita → primera sesión → plan mensual o redes sociales → consulta online → bono de sesiones",
      "reason": "Entender qué camino de conversión funciona mejor y optimizar cada etapa del proceso de captación",
      "description": "Sistema completo de funnels adaptados al flujo real de un entrenador personal dentro del módulo FunnelsAdquisicion que incluya: 1) Funnels predefinidos específicos del sector: consulta gratuita → primera sesión → plan mensual, redes sociales → consulta online → bono de sesiones, referido → primera sesión → plan recurrente, contenido orgánico → lead magnet → consulta → cliente activo, eventos/webinars → consulta → primera sesión → plan, y más, 2) Visualización del flujo completo desde la primera interacción hasta la conversión en cliente activo, mostrando cada etapa del proceso con métricas de conversión por etapa, 3) Identificación automática del origen de cada lead: consulta directa, redes sociales (Instagram, Facebook, TikTok), referido, contenido orgánico, eventos, Google Ads, Meta Ads, email marketing, y otros canales, 4) Tracking del recorrido completo de cada lead a través de todas las etapas del funnel, desde el primer punto de contacto hasta la conversión final, 5) Métricas de conversión por etapa: tasa de conversión de primera interacción a consulta solicitada, de consulta solicitada a consulta realizada, de consulta realizada a primera sesión pagada, de primera sesión a cliente activo, y tasas de conversión entre etapas intermedias, 6) Visualización de cuellos de botella: identificación automática de las etapas donde se pierden más prospectos, con alertas y sugerencias de mejora, 7) Comparativa de funnels: análisis comparativo de diferentes caminos de conversión mostrando cuál genera más clientes, mayor valor promedio, mejor retención, y menor tiempo de conversión, 8) Métricas de calidad por origen: análisis de qué canales de primera interacción generan leads de mayor calidad (mayor tasa de conversión, mayor valor, mejor retención), 9) Tiempo promedio de conversión por etapa: métricas de velocidad mostrando cuánto tiempo tarda un lead en avanzar de una etapa a la siguiente, identificando oportunidades de aceleración, 10) Funnels personalizables: posibilidad de crear funnels personalizados definiendo etapas específicas según el modelo de negocio del entrenador, 11) Integración con datos reales: conexión con el sistema de agenda para consultas y sesiones, con el sistema de pagos para conversiones, con el sistema de clientes para activación, y con el sistema de leads para tracking de origen, 12) Dashboard visual interactivo: visualización gráfica del funnel con capacidad de hacer clic en cada etapa para ver detalles, leads individuales, y acciones recomendadas, 13) Segmentación por período: análisis de funnels por diferentes períodos de tiempo (semana, mes, trimestre) para identificar tendencias y cambios en el comportamiento de conversión, 14) Alertas y notificaciones: notificaciones cuando hay cambios significativos en las tasas de conversión de cualquier etapa o cuando se detectan cuellos de botella nuevos, 15) Exportación y reportes: posibilidad de exportar análisis de funnels en diferentes formatos para presentaciones o análisis externo. El sistema debe reemplazar completamente los funnels genéricos de marketing digital por funnels específicos que reflejen el proceso real de captación y conversión de un entrenador personal."
    },
    {
      "id": "US-FA-003",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Ver cuántas consultas gratuitas se convierten en primera sesión pagada y luego en clientes con plan activo",
      "reason": "Identificar en qué punto pierdo más prospectos y mejorar ese momento crítico",
      "description": "Sistema de funnel de conversión detallado dentro del módulo FunnelsAdquisicion que muestre el flujo completo desde consulta hasta cliente activo, incluyendo: 1) Visualización del funnel con las 4 etapas principales: Consulta solicitada (total de consultas recibidas, independientemente del canal de origen), Consulta realizada (consultas que efectivamente se llevaron a cabo, excluyendo no-shows y cancelaciones), Primera sesión pagada (clientes que compraron y asistieron a su primera sesión de entrenamiento), Cliente activo (clientes que compraron un plan mensual, bono de sesiones, o segunda sesión, indicando compromiso a largo plazo), 2) Métricas de conversión entre cada etapa: tasa de conversión de Consulta solicitada → Consulta realizada (consultas realizadas / consultas solicitadas), tasa de conversión de Consulta realizada → Primera sesión pagada (primera sesión pagada / consultas realizadas), tasa de conversión de Primera sesión pagada → Cliente activo (clientes activos / primera sesión pagada), y tasa de conversión global de Consulta solicitada → Cliente activo (conversión end-to-end), 3) Números absolutos y porcentajes: visualización clara de cuántos leads hay en cada etapa (ej: 100 consultas solicitadas, 75 consultas realizadas, 50 primera sesión pagada, 30 clientes activos) junto con los porcentajes de conversión, 4) Identificación de pérdidas por etapa: análisis detallado de cuántos prospectos se pierden en cada transición (ej: 25 consultas no realizadas, 25 consultas realizadas que no compraron primera sesión, 20 primera sesión que no se convirtieron en clientes activos), 5) Tiempo promedio entre etapas: métricas de velocidad mostrando cuánto tiempo transcurre desde consulta solicitada hasta consulta realizada, desde consulta realizada hasta primera sesión pagada, y desde primera sesión hasta activación como cliente, 6) Análisis de causas de pérdida: identificación de razones principales de abandono en cada etapa (no-show en consultas, falta de seguimiento post-consulta, precio, falta de conexión, etc.) con datos cuantitativos, 7) Comparativa temporal: comparación de tasas de conversión entre diferentes períodos (semana, mes, trimestre) para identificar mejoras o deterioros en el proceso, 8) Segmentación por canal de origen: desglose del funnel completo por canal de captación (Instagram, Facebook, referidos, Google, eventos, etc.) mostrando qué canales tienen mejores tasas de conversión en cada etapa, 9) Valor promedio por etapa: métricas de valor mostrando el valor promedio de cada consulta realizada, primera sesión pagada, y cliente activo, con cálculo de valor total generado en cada etapa, 10) Visualización gráfica interactiva: gráfico de funnel visual con capacidad de hacer clic en cada etapa para ver detalles, listado de leads/clientes en esa etapa, y acciones recomendadas, 11) Alertas de cuellos de botella: notificaciones automáticas cuando la tasa de conversión de alguna etapa cae por debajo de un umbral configurable o cuando hay cambios significativos, 12) Análisis de tendencias: gráficos de líneas mostrando la evolución de cada etapa y las tasas de conversión a lo largo del tiempo, 13) Integración con datos reales: conexión directa con el sistema de agenda para consultas y sesiones, con el sistema de pagos para primera sesión y activación, y con el sistema de clientes para identificar clientes activos, 14) Filtros y segmentación: posibilidad de filtrar el funnel por período de tiempo, canal de origen, tipo de consulta, y otros criterios relevantes, 15) Exportación de reportes: posibilidad de exportar el análisis del funnel en diferentes formatos (PDF, Excel) para presentaciones o análisis externo, 16) Recomendaciones de mejora: sugerencias automáticas basadas en los datos (ej: 'Tu tasa de conversión de consulta a primera sesión es del 50%, considera mejorar el seguimiento post-consulta'), 17) Benchmarking: comparación opcional con promedios del sector o con períodos anteriores del mismo entrenador para contextualizar el rendimiento. El sistema debe proporcionar una visión clara y accionable del proceso de conversión, permitiendo identificar exactamente dónde se pierden más prospectos y qué acciones tomar para mejorar."
    },
    {
      "id": "US-FA-004",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Crear y gestionar recursos descargables como guías de entrenamiento o calculadoras de objetivos",
      "reason": "Captar leads interesados en entrenamiento y nutrirlos antes de ofrecerles una consulta",
      "description": "Sistema completo para crear, publicar y medir performance de lead magnets específicos del sector fitness dentro del módulo FunnelsAdquisicion que incluya: 1) Biblioteca de plantillas predefinidas específicas para fitness: guías de entrenamiento (rutinas de 7 días, planes de hipertrofia, programas de pérdida de peso), calculadoras interactivas (macronutrientes, IMC, calorías diarias, porcentaje de grasa corporal), checklists descargables (preparación para primera sesión, lista de ejercicios en casa, plan de alimentación semanal), quizzes de evaluación (nivel de fitness, objetivos principales, tipo de cuerpo), y recursos educativos (PDFs con tips nutricionales, guías de suplementación, técnicas de ejercicios), 2) Editor visual intuitivo para personalizar cada lead magnet: modificar textos, imágenes, colores, branding personal, y contenido específico manteniendo la estructura profesional de la plantilla, 3) Configuración de formulario de captura: definir campos requeridos (nombre, email, teléfono) y opcionales personalizados (objetivo principal, nivel de experiencia, preferencias de entrenamiento), con validación y diseño responsive, 4) Sistema de publicación y distribución: generación automática de enlace único para compartir en redes sociales, código embed para incrustar en página web externa, y página de destino optimizada para conversión, 5) Integración con sistema de leads: cada descarga de lead magnet crea automáticamente un lead en el CRM con etiquetas específicas según el tipo de magnet descargado, información del formulario completado, y origen de tráfico, 6) Conexión con sistema de nurturing: posibilidad de conectar cada lead magnet a una automatización de email o WhatsApp que se active automáticamente cuando alguien descarga el recurso, con secuencias predefinidas específicas por tipo de magnet (ej: descarga guía de nutrición → secuencia de 5 emails sobre alimentación saludable), 7) Métricas de performance detalladas: visualizaciones totales de la página del lead magnet, tasa de conversión de visitante a lead (descargas / visitantes), número total de leads generados, tasa de conversión de lead a consulta solicitada, tasa de conversión de lead a cliente activo, tiempo promedio desde descarga hasta consulta, tiempo promedio desde descarga hasta conversión a cliente, y valor promedio del cliente generado por cada lead magnet, 8) Dashboard comparativo de lead magnets: vista que muestre todos los lead magnets creados con métricas clave lado a lado, permitiendo identificar cuáles generan más leads, mejor calidad de leads, y mayor conversión a clientes, 9) Análisis de calidad de leads: métricas que muestren la calidad de los leads generados por cada magnet (tasa de no-show en consultas, tasa de conversión a primera sesión, satisfacción promedio, retención de clientes), 10) Segmentación automática: sistema que asigne etiquetas y segmentos automáticamente a los leads según el lead magnet descargado (ej: descarga 'Guía de Hipertrofia' → etiqueta 'Interesado en ganar músculo'), 11) Página de agradecimiento personalizable: configuración de mensaje post-descarga que incluya el recurso descargado, CTAs adicionales (seguir en redes sociales, agendar consulta), y opciones de compartir, 12) Tracking de origen de tráfico: identificación automática de desde dónde viene cada visitante (Instagram, Facebook, Google, email, referido, etc.) y atribución de leads y conversiones a cada canal de promoción, 13) A/B testing de elementos: posibilidad de probar diferentes versiones de títulos, descripciones, imágenes, o formularios para optimizar la tasa de conversión, 14) Gestión de estado: control de publicación (borrador, publicado, archivado) con posibilidad de pausar temporalmente un lead magnet sin eliminarlo, 15) Exportación de métricas: posibilidad de exportar reportes de performance de lead magnets en diferentes formatos (PDF, Excel) para análisis externo o presentaciones, 16) Integración con ContentSocialStudio: posibilidad de promocionar lead magnets directamente desde el planner de redes sociales con enlaces trackeados, 17) Plantillas personalizables: guardar lead magnets personalizados como nuevas plantillas reutilizables para crear variaciones rápidamente, 18) Sistema de versiones: control de versiones de cada lead magnet permitiendo ver historial de cambios y restaurar versiones anteriores, 19) Notificaciones y alertas: alertas cuando un lead magnet genera un lead nuevo, cuando alcanza hitos de descargas, o cuando hay cambios significativos en las tasas de conversión, 20) Optimización continua: sugerencias automáticas basadas en los datos (ej: 'Tu lead magnet X tiene baja tasa de conversión, considera mejorar el título o reducir campos del formulario'). El sistema debe estar completamente integrado con el módulo de leads para tracking automático, con el sistema de nurturing para automatizaciones, y con el dashboard de métricas para análisis de performance."
    },
    {
      "id": "US-FA-005",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Ver de dónde vienen mis mejores clientes: Instagram Ads, Google local, referidos, contenido orgánico o eventos",
      "reason": "Saber dónde debo invertir más tiempo y presupuesto para crecer",
      "description": "Dashboard completo de atribución y origen de leads dentro del módulo FunnelsAdquisicion que muestre el origen de cada lead y cliente con métricas de conversión y valor por canal, adaptado a los canales reales que usa un entrenador, incluyendo: 1) Identificación automática del origen de cada lead y cliente: tracking preciso del primer punto de contacto y todos los puntos de interacción previos a la conversión, con soporte para canales específicos del sector fitness como Instagram (orgánico y ads), Facebook (orgánico y ads), Google (búsqueda local, Google Ads, Google My Business), TikTok (orgánico y ads), YouTube (orgánico y ads), WhatsApp (directo, grupos, enlaces), referidos (clientes existentes, otros entrenadores, partners), eventos (webinars, talleres, retos, ferias de fitness), contenido orgánico (blog, lead magnets, posts en redes), email marketing (newsletters, secuencias de nurturing), y otros canales (LinkedIn, Twitter, aplicaciones de fitness, colaboraciones), 2) Visualización del recorrido completo del cliente: timeline que muestre todos los puntos de contacto desde el primer contacto hasta la conversión, identificando el canal de primera interacción, canales de interacción intermedios, y canal de conversión final, 3) Métricas de captación por canal: número total de leads generados por cada canal, número de consultas solicitadas por canal, número de consultas realizadas por canal, número de primera sesión pagada por canal, número de clientes activos generados por canal, y tasa de crecimiento de leads por canal (comparativa con períodos anteriores), 4) Métricas de conversión por canal: tasa de conversión de lead a consulta solicitada (consultas solicitadas / leads generados), tasa de conversión de consulta solicitada a consulta realizada (consultas realizadas / consultas solicitadas), tasa de conversión de consulta realizada a primera sesión pagada (primera sesión / consultas realizadas), tasa de conversión de primera sesión a cliente activo (clientes activos / primera sesión), y tasa de conversión end-to-end (clientes activos / leads generados), 5) Métricas de valor por canal: valor promedio de primera sesión por canal, valor promedio del cliente nuevo por canal, valor total generado por canal en el período, valor de vida del cliente (LTV) promedio por canal, y ROI estimado por canal (valor generado / inversión en tiempo o dinero), 6) Métricas de calidad por canal: tasa de no-show en consultas por canal, tasa de cancelación de primera sesión por canal, satisfacción promedio post-consulta por canal, satisfacción promedio post-primera-sesión por canal, tasa de retención a 30, 60 y 90 días por canal, y duración promedio de la relación comercial por canal, 7) Métricas de velocidad por canal: tiempo promedio desde primer contacto hasta consulta solicitada, tiempo promedio desde consulta solicitada hasta consulta realizada, tiempo promedio desde consulta realizada hasta primera sesión pagada, tiempo promedio desde primera sesión hasta activación como cliente, y tiempo total promedio de conversión end-to-end, 8) Dashboard visual interactivo: gráficos de barras comparativos mostrando leads, conversiones y valor por canal, gráficos de líneas mostrando tendencias temporales por canal, gráficos de embudo mostrando la conversión en cada etapa por canal, y gráficos de dispersión mostrando relación entre volumen y calidad de leads por canal, 9) Ranking de canales: ordenamiento automático de canales según diferentes criterios (más leads generados, mayor tasa de conversión, mayor valor generado, mejor calidad de leads, mejor retención, mejor ROI), con posibilidad de cambiar el criterio de ordenamiento, 10) Análisis de atribución multi-touch: visualización de cómo diferentes canales contribuyen a la conversión de un cliente, identificando canales de primera interacción, canales de interacción intermedia, y canales de conversión, con modelos de atribución (first-touch, last-touch, linear, time-decay), 11) Segmentación por período: análisis de origen y performance por diferentes períodos de tiempo (últimos 7 días, últimos 30 días, últimos 90 días, mes actual, mes anterior, trimestre, año), con comparativas entre períodos mostrando cambios en volumen, conversión y valor por canal, 12) Filtros y segmentación avanzada: posibilidad de filtrar por tipo de lead (frío, templado, caliente), por etapa del funnel (lead, consulta solicitada, consulta realizada, primera sesión, cliente activo), por tipo de cliente (nuevo, reactivado, referido), y por otros criterios relevantes, 13) Detalle individual por canal: vista expandible para cada canal mostrando lista de leads generados, lista de clientes convertidos, métricas detalladas, gráficos de tendencia, y acciones recomendadas, 14) Comparativa de canales: herramienta de comparación lado a lado que permita seleccionar 2-4 canales y comparar todas sus métricas simultáneamente (volumen, conversión, valor, calidad, velocidad), 15) Identificación de canales de alto valor: sistema que destaque automáticamente los canales que generan clientes de mayor valor, mejor retención, o mayor satisfacción, con recomendaciones de inversión, 16) Alertas y notificaciones: notificaciones cuando hay cambios significativos en el volumen de leads de un canal, cuando la tasa de conversión de un canal cae por debajo de un umbral, o cuando un canal nuevo muestra potencial, 17) Integración con datos reales: conexión directa con el sistema de leads para tracking de origen, con el sistema de agenda para consultas y sesiones, con el sistema de pagos para valor generado, con el sistema de clientes para retención, y con plataformas de publicidad (Meta Ads, Google Ads) para datos de inversión y rendimiento, 18) Exportación de reportes: posibilidad de exportar análisis de origen y atribución en diferentes formatos (PDF, Excel) con gráficos y tablas detalladas, 19) Insights y recomendaciones: sugerencias automáticas basadas en los datos (ej: 'Instagram orgánico genera el 40% de tus clientes con mejor retención, considera aumentar tu presencia allí', 'Google Ads tiene alta tasa de conversión pero bajo volumen, considera aumentar presupuesto'), 20) Vista de tendencias: gráficos de líneas mostrando la evolución de cada canal a lo largo del tiempo, identificando canales en crecimiento, canales en declive, y canales estables, 21) Análisis de estacionalidad: identificación de patrones estacionales por canal (ej: más leads de Instagram en verano, más referidos en enero), 22) Benchmarking opcional: comparación de métricas propias con promedios del sector o con períodos anteriores del mismo entrenador para contextualizar el rendimiento. El dashboard debe proporcionar una visión clara y accionable de qué canales generan más y mejores clientes, permitiendo tomar decisiones informadas sobre dónde invertir tiempo y presupuesto para maximizar el crecimiento del negocio."
    },
    {
      "id": "US-FA-006",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Crear y gestionar eventos como retos, webinars o talleres como herramientas de captación",
      "reason": "Atraer nuevos prospectos y convertir participantes en clientes",
      "description": "Sistema completo para crear, gestionar y medir eventos como herramientas de captación dentro del módulo FunnelsAdquisicion que incluya: 1) Creación de eventos: formulario para crear diferentes tipos de eventos (retos de fitness, webinars educativos, talleres presenciales, clases maestras, eventos de comunidad, bootcamps, charlas de nutrición, y más) con campos para nombre, descripción, tipo de evento, fecha y hora, duración, modalidad (presencial, online, híbrido), ubicación o link de videollamada, capacidad máxima, precio (gratis o de pago), imagen promocional, y objetivos del evento, 2) Configuración de inscripciones: formulario de inscripción personalizable con campos requeridos (nombre, email, teléfono) y opcionales (objetivos, nivel de experiencia, preferencias), sistema de confirmación automática por email o WhatsApp, gestión de lista de espera cuando se alcanza la capacidad máxima, y control de inscripciones (abiertas, cerradas, por invitación), 3) Promoción y distribución: generación automática de página de evento optimizada para conversión, enlace único para compartir en redes sociales, código embed para incrustar en página web externa, integración con ContentSocialStudio para promocionar eventos desde el planner de redes sociales, y sistema de invitaciones personalizadas con tracking de referidos, 4) Gestión de participantes: lista completa de inscritos con información de contacto, estado de asistencia (inscrito, confirmado, asistió, no asistió), notas personalizadas por participante, sistema de check-in para eventos presenciales, y exportación de lista de participantes en diferentes formatos (Excel, CSV, PDF), 5) Métricas de conversión detalladas: número total de inscripciones, tasa de asistencia (participantes que asistieron / inscripciones totales), número de participantes que solicitaron consulta después del evento, tasa de conversión de participante a consulta solicitada (consultas / participantes), número de participantes que agendaron consulta, tasa de conversión de participante a consulta agendada, número de participantes que realizaron consulta, tasa de conversión de participante a consulta realizada, número de participantes que compraron primera sesión, tasa de conversión de participante a primera sesión pagada, número de participantes que se convirtieron en clientes activos, tasa de conversión de participante a cliente activo (conversión end-to-end), tiempo promedio desde evento hasta consulta solicitada, tiempo promedio desde evento hasta primera sesión pagada, tiempo promedio desde evento hasta conversión a cliente activo, y valor promedio del cliente generado por evento, 6) Análisis de calidad de participantes: tasa de no-show en consultas de participantes del evento, tasa de cancelación de primera sesión, satisfacción promedio post-evento (encuestas), satisfacción promedio post-consulta, tasa de retención a 30, 60 y 90 días de clientes generados desde eventos, y duración promedio de la relación comercial de clientes generados desde eventos, 7) Comparativa de eventos: dashboard que muestre todos los eventos creados con métricas clave lado a lado, permitiendo identificar qué tipos de eventos generan más inscripciones, mejor asistencia, mayor conversión a clientes, y mejor calidad de leads, análisis de qué eventos tienen mejor ROI (valor generado / costo del evento), y identificación de eventos más exitosos para replicar, 8) Automatización de seguimiento post-evento: secuencia automática de mensajes que se active cuando alguien se inscribe al evento (confirmación, recordatorio días antes, recordatorio el día del evento), secuencia post-evento que se active automáticamente después de que termine el evento (agradecimiento, encuesta de satisfacción, oferta especial de consulta, seguimiento personalizado), personalización de mensajes según tipo de evento y comportamiento del participante (asistió, no asistió, mostró interés), integración con sistema de nurturing para continuar el seguimiento hasta conversión, y posibilidad de pausar o modificar automatizaciones según necesidad, 9) Segmentación automática: sistema que asigne etiquetas y segmentos automáticamente a los participantes según el evento al que asistieron (ej: asistió 'Reto de 30 días' → etiqueta 'Interesado en retos'), creación automática de segmentos de participantes por tipo de evento para campañas futuras, y tracking del origen de cada participante (redes sociales, referido, email, etc.), 10) Gestión de recursos del evento: sistema para compartir materiales del evento (presentaciones, grabaciones, recursos descargables) con participantes, acceso controlado a recursos según asistencia o estado de inscripción, y tracking de descargas y engagement con recursos compartidos, 11) Integración con sistema de agenda: conexión automática con el calendario para bloquear horarios del evento, creación automática de recordatorios en el calendario del entrenador, y sincronización de participantes con el sistema de clientes cuando se convierten, 12) Métricas de promoción: tracking de origen de tráfico a la página del evento (Instagram, Facebook, Google, email, referido, etc.), número de visualizaciones de la página del evento, tasa de conversión de visitante a inscrito (inscripciones / visitantes), y atribución de inscripciones y conversiones a cada canal de promoción, 13) A/B testing de elementos: posibilidad de probar diferentes versiones de títulos, descripciones, imágenes, o formularios de inscripción para optimizar la tasa de conversión, 14) Gestión de estado: control de publicación (borrador, publicado, en curso, finalizado, archivado) con posibilidad de pausar temporalmente un evento sin eliminarlo, 15) Exportación de métricas: posibilidad de exportar reportes de performance de eventos en diferentes formatos (PDF, Excel) para análisis externo o presentaciones, 16) Notificaciones y alertas: alertas cuando se alcanza la capacidad máxima, cuando hay cambios significativos en las tasas de conversión, cuando un evento genera un cliente nuevo, o cuando se acerca la fecha del evento sin suficientes inscripciones, 17) Sistema de versiones y plantillas: guardar eventos exitosos como plantillas reutilizables para crear eventos similares rápidamente, control de versiones de cada evento permitiendo ver historial de cambios, y biblioteca de plantillas predefinidas para diferentes tipos de eventos, 18) Análisis de tendencias: gráficos de líneas mostrando la evolución de inscripciones, asistencia y conversiones a lo largo del tiempo, identificación de patrones estacionales (ej: más inscripciones en enero para retos), y comparativa de eventos entre diferentes períodos, 19) Optimización continua: sugerencias automáticas basadas en los datos (ej: 'Tu evento X tiene baja tasa de asistencia, considera enviar recordatorios más frecuentes', 'Los eventos de tipo Y generan mejor conversión, considera crear más'), 20) Integración con otros módulos: conexión con el sistema de leads para tracking automático de participantes como leads, con el sistema de nurturing para automatizaciones, con el dashboard de métricas para análisis de performance, y con ContentSocialStudio para promoción. El sistema debe proporcionar una solución completa para usar eventos como herramienta efectiva de captación, desde la creación hasta la conversión de participantes en clientes activos."
    },
    {
      "id": "US-FA-007",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Saber qué clientes tienen mayor valor de vida y retención según el canal de captación",
      "reason": "Priorizar los canales que me traen clientes de mayor calidad, no solo cantidad",
      "description": "Sistema completo de métricas avanzadas de calidad de clientes por canal de origen dentro del módulo FunnelsAdquisicion que muestre no solo el volumen de leads, sino el valor real y la calidad de los clientes generados por cada canal, incluyendo: 1) Valor promedio del cliente por canal: cálculo del valor promedio de primera sesión por canal de origen (suma de valores de primera sesión / número de primera sesión por canal), valor promedio del cliente nuevo por canal (suma de valores de clientes activos / número de clientes activos por canal), valor total generado por canal en el período analizado (suma de todos los ingresos atribuidos a clientes de ese canal), valor de vida del cliente (LTV - Lifetime Value) promedio por canal calculado como la suma de todos los ingresos históricos de clientes de ese canal dividido por el número de clientes, y comparativa de valores promedio entre canales para identificar cuáles generan clientes de mayor valor, 2) Tasa de retención por canal: tasa de retención a 30 días por canal (clientes activos a los 30 días / clientes nuevos del canal), tasa de retención a 60 días por canal (clientes activos a los 60 días / clientes nuevos del canal), tasa de retención a 90 días por canal (clientes activos a los 90 días / clientes nuevos del canal), tasa de retención a 6 meses por canal, tasa de retención a 1 año por canal, gráficos de cohortes mostrando cómo evoluciona la retención de clientes por canal a lo largo del tiempo, y comparativa de tasas de retención entre canales para identificar cuáles generan clientes más leales, 3) Duración de la relación comercial por origen: duración promedio de la relación comercial por canal (tiempo promedio desde primera sesión hasta última sesión o abandono), mediana de duración de relación por canal (más robusta ante outliers), distribución de duraciones (cuántos clientes duran 1 mes, 3 meses, 6 meses, 1 año, etc.) por canal, tiempo promedio hasta primera compra recurrente (plan mensual o bono) por canal, frecuencia promedio de sesiones por canal (sesiones por mes), y comparativa de duraciones entre canales para identificar cuáles generan relaciones más duraderas, 4) Métricas de calidad adicionales por canal: tasa de no-show en consultas por canal (consultas no realizadas / consultas agendadas), tasa de cancelación de primera sesión por canal (cancelaciones / primera sesión agendadas), satisfacción promedio post-consulta por canal (basada en encuestas), satisfacción promedio post-primera-sesión por canal, tasa de recompra por canal (clientes que compran segunda vez / clientes que compraron primera vez), frecuencia promedio de compras por canal (número de compras por cliente en el período), valor promedio por transacción por canal, y tasa de referidos generados por canal (clientes que refieren a otros / total de clientes del canal), 5) Análisis de valor de vida del cliente (LTV) detallado: cálculo de LTV histórico por canal (suma de todos los ingresos de clientes desde su primera compra hasta la fecha actual), proyección de LTV futuro por canal (basada en patrones históricos y tasas de retención), LTV promedio por canal con desglose de percentiles (P25, P50, P75, P90) para entender la distribución, tiempo promedio hasta alcanzar cierto valor de LTV por canal, y comparativa de LTV entre canales con visualizaciones gráficas, 6) Métricas de rentabilidad por canal: ROI estimado por canal (valor total generado / inversión en tiempo o dinero en ese canal), costo de adquisición de cliente (CAC) por canal si aplica (inversión en publicidad / clientes generados), ratio LTV/CAC por canal para identificar canales más rentables, margen de beneficio estimado por canal, y tiempo de recuperación de inversión por canal, 7) Análisis de cohortes por canal: seguimiento de cohortes de clientes por canal (clientes adquiridos en el mismo período) mostrando cómo evoluciona su valor y retención a lo largo del tiempo, comparativa de cohortes entre diferentes períodos para identificar tendencias, y análisis de cómo cambia la calidad de clientes por canal a lo largo del tiempo, 8) Segmentación de clientes de alto valor por canal: identificación de clientes 'top' (percentil 90 de valor) por canal, análisis de características comunes de clientes de alto valor por canal, tasa de clientes de alto valor por canal (clientes top / total de clientes del canal), y recomendaciones de cómo replicar clientes de alto valor de canales exitosos, 9) Dashboard visual interactivo: gráficos de barras comparativos mostrando valor promedio, LTV, retención y duración por canal lado a lado, gráficos de líneas mostrando evolución de estas métricas a lo largo del tiempo por canal, gráficos de dispersión mostrando relación entre volumen de clientes y calidad (valor, retención) por canal, gráficos de embudo mostrando cómo evoluciona el valor desde lead hasta cliente de largo plazo por canal, y tablas comparativas con todas las métricas por canal ordenables y filtrables, 10) Ranking de canales por calidad: ordenamiento automático de canales según diferentes criterios de calidad (mayor valor promedio, mayor LTV, mejor retención, mayor duración de relación, mejor ratio LTV/CAC, mayor tasa de clientes top), posibilidad de crear rankings personalizados combinando múltiples métricas, y identificación automática de canales 'estrella' (alto volumen + alta calidad) y canales 'diamante' (bajo volumen pero muy alta calidad), 11) Análisis de correlación: identificación de qué características de canales se correlacionan con mayor valor, mejor retención o mayor duración, análisis de qué tipos de leads de cada canal tienen mayor probabilidad de convertirse en clientes de alto valor, y recomendaciones basadas en patrones identificados, 12) Segmentación por período: análisis de calidad de clientes por canal en diferentes períodos de tiempo (últimos 7 días, últimos 30 días, últimos 90 días, mes actual, mes anterior, trimestre, año), comparativas entre períodos mostrando si la calidad de clientes por canal está mejorando o empeorando, e identificación de tendencias y cambios en la calidad de clientes por canal, 13) Filtros y segmentación avanzada: posibilidad de filtrar por tipo de cliente (nuevo, reactivado, referido), por etapa del funnel (primera sesión, cliente activo, cliente de largo plazo), por rango de valor (clientes de bajo, medio, alto valor), y por otros criterios relevantes, 14) Detalle individual por canal: vista expandible para cada canal mostrando lista de clientes generados con sus métricas individuales (valor generado, duración de relación, estado actual), gráficos de tendencia de calidad a lo largo del tiempo, análisis de distribución de valores (histogramas), y acciones recomendadas basadas en los datos del canal, 15) Comparativa de canales: herramienta de comparación lado a lado que permita seleccionar 2-4 canales y comparar todas sus métricas de calidad simultáneamente (valor promedio, LTV, retención, duración, rentabilidad), visualización de diferencias estadísticamente significativas entre canales, y recomendaciones de inversión basadas en la comparativa, 16) Alertas y notificaciones: notificaciones cuando hay cambios significativos en el valor promedio, LTV, retención o duración de un canal, alertas cuando un canal muestra deterioro en la calidad de clientes, y notificaciones cuando un canal nuevo muestra potencial de alta calidad, 17) Integración con datos reales: conexión directa con el sistema de pagos para cálculo preciso de valores, con el sistema de clientes para tracking de retención y duración, con el sistema de agenda para frecuencia de sesiones, y con el sistema de leads para atribución de origen, 18) Exportación de reportes: posibilidad de exportar análisis de calidad de clientes por canal en diferentes formatos (PDF, Excel) con gráficos y tablas detalladas, reportes personalizables con métricas seleccionadas, y reportes comparativos entre canales, 19) Insights y recomendaciones: sugerencias automáticas basadas en los datos (ej: 'Instagram orgánico genera clientes con 40% mayor LTV que Facebook Ads, considera aumentar tu presencia orgánica', 'Los referidos tienen 2x mejor retención, considera fortalecer tu programa de referidos', 'Google Ads genera clientes de alto valor pero bajo volumen, considera aumentar presupuesto'), recomendaciones de cómo mejorar la calidad de clientes de canales con bajo rendimiento, y sugerencias de estrategias para replicar el éxito de canales de alta calidad, 20) Vista de tendencias: gráficos de líneas mostrando la evolución de valor promedio, LTV, retención y duración por canal a lo largo del tiempo, identificación de canales en mejora, canales en declive, y canales estables en términos de calidad, y análisis de estacionalidad en la calidad de clientes por canal, 21) Benchmarking opcional: comparación de métricas propias con promedios del sector o con períodos anteriores del mismo entrenador para contextualizar el rendimiento, y identificación de oportunidades de mejora basadas en benchmarks, 22) Métricas compuestas de calidad: creación de índices compuestos que combinen múltiples métricas (ej: 'Índice de Calidad de Cliente' = (LTV * Retención * Duración) / 1000) para ranking simplificado, visualización de canales en matriz de volumen vs calidad (cuadrantes: alto volumen + alta calidad, alto volumen + baja calidad, bajo volumen + alta calidad, bajo volumen + baja calidad), y recomendaciones estratégicas basadas en la posición de cada canal en la matriz. El sistema debe proporcionar una visión completa y accionable de la calidad de clientes generados por cada canal, permitiendo tomar decisiones informadas sobre dónde invertir tiempo y presupuesto para maximizar no solo la cantidad, sino la calidad y el valor a largo plazo de los clientes adquiridos."
    },
    {
      "id": "US-FA-008",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Que el sistema me recuerde automáticamente seguir con leads que solicitaron consulta pero no la agendaron, o que la hicieron pero no compraron",
      "reason": "No perder oportunidades y mejorar mi tasa de conversión sin tener que recordarlo manualmente",
      "description": "Sistema de alertas y tareas automáticas que identifique leads en riesgo de no convertirse y sugiera acciones de seguimiento personalizadas según el tiempo transcurrido."
    },
    {
      "id": "US-FA-009",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Ver qué porcentaje de clientes que compran su primera sesión se convierten en planes mensuales o bonos",
      "reason": "Entender si mi estrategia de venta post-primera-sesión está funcionando y cómo mejorarla",
      "description": "Métrica específica que muestre la conversión de primera sesión única a cliente con plan recurrente o bono, con comparativa por período y sugerencias de mejora."
    },
    {
      "id": "US-FA-010",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Ver el rendimiento de mis publicaciones en redes sociales que generan consultas",
      "reason": "Saber qué tipo de contenido funciona mejor para atraer clientes y replicarlo",
      "description": "Integración con métricas de redes sociales que muestre qué publicaciones generan más consultas, engagement que se convierte en leads y ROI de tiempo invertido en cada red."
    },
    {
      "id": "US-FA-012",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Ver cuántos clientes nuevos vienen de referidos, quiénes son mis mejores embajadores y el valor generado",
      "reason": "Optimizar mi programa de referidos y recompensar a los clientes que más me ayudan a crecer",
      "description": "Sistema de tracking de referidos que muestre origen, conversión, valor de cliente referido y métricas de programa de referidos con sugerencias de mejora."
    },
    {
      "id": "US-FA-013",
      "feature": "src/features/FunnelsAdquisicion",
      "persona": "Entrenador personal",
      "goal": "Comparar mis métricas de captación entre diferentes períodos",
      "reason": "Identificar si estoy mejorando o empeorando y qué factores influyen",
      "description": "Funcionalidad de comparación de períodos que muestre cambios en consultas, conversiones, clientes nuevos y valor promedio, con explicaciones de las variaciones. El sistema debe incluir: 1) Selección de períodos a comparar: selector para elegir dos períodos (últimos 7 días vs anteriores 7 días, último mes vs mes anterior, último trimestre vs trimestre anterior, o períodos personalizados), visualización clara de las fechas de cada período comparado, y posibilidad de comparar períodos de diferente duración (ej: último mes vs último trimestre) con normalización de métricas, 2) Métricas de consultas comparadas: número total de consultas generadas en período actual vs período anterior, cambio absoluto (diferencia numérica) y cambio porcentual (variación porcentual), número de consultas agendadas en cada período, tasa de agendamiento (consultas agendadas / consultas generadas) en cada período, número de consultas realizadas en cada período, tasa de realización (consultas realizadas / consultas agendadas) en cada período, tiempo promedio desde consulta hasta agendamiento en cada período, y explicación automática de las variaciones (ej: 'Las consultas aumentaron 15% este mes, principalmente por un incremento en Instagram Ads'), 3) Métricas de conversión comparadas: tasa de conversión de consulta a primera sesión en período actual vs período anterior, cambio absoluto y porcentual en la tasa de conversión, número de primera sesión pagada en cada período, tasa de conversión de primera sesión a cliente activo en cada período, tasa de conversión end-to-end (consulta a cliente activo) en cada período, tiempo promedio de conversión en cada período, y explicación de variaciones (ej: 'La tasa de conversión mejoró 8% este mes, posiblemente por mejor seguimiento post-consulta'), 4) Métricas de clientes nuevos comparadas: número total de clientes nuevos en período actual vs período anterior, cambio absoluto y porcentual en clientes nuevos, desglose de clientes nuevos por tipo (plan mensual, bono de sesiones, segunda sesión) en cada período, tasa de crecimiento de clientes nuevos (clientes nuevos período actual / clientes nuevos período anterior), y explicación de variaciones (ej: 'Los clientes nuevos aumentaron 20% este mes, con mayor crecimiento en planes mensuales'), 5) Métricas de valor promedio comparadas: valor promedio de primera sesión en período actual vs período anterior, cambio absoluto y porcentual en valor promedio de primera sesión, valor promedio del cliente nuevo en cada período, cambio absoluto y porcentual en valor promedio del cliente nuevo, valor total generado en cada período, cambio absoluto y porcentual en valor total, y explicación de variaciones (ej: 'El valor promedio aumentó 12% este mes, principalmente por más clientes eligiendo planes mensuales'), 6) Visualización comparativa: gráficos lado a lado mostrando cada métrica en ambos períodos (gráficos de barras comparativos, gráficos de líneas superpuestas mostrando tendencias, indicadores visuales de cambio con flechas y colores (verde para mejoras, rojo para empeoramientos), y tablas comparativas con todas las métricas y sus variaciones, 7) Explicaciones automáticas de variaciones: sistema que analice los cambios y proporcione explicaciones contextuales para cada variación significativa, identificación de factores que pueden haber influido (cambios en canales de captación, cambios en estrategia, estacionalidad, eventos especiales), sugerencias de acciones basadas en las comparativas (ej: 'Las consultas aumentaron pero la conversión bajó, considera mejorar el seguimiento post-consulta'), y alertas cuando hay cambios significativos (variaciones superiores a un umbral configurable), 8) Comparativa por canal: desglose de todas las métricas comparadas por canal de origen (Instagram, Facebook, Google, referidos, etc.), identificación de qué canales mejoraron o empeoraron entre períodos, comparativa de valor promedio por canal entre períodos, y explicaciones de variaciones por canal, 9) Comparativa por tipo de funnel: análisis comparativo de métricas por tipo de funnel (consulta gratuita → primera sesión → plan mensual, redes sociales → consulta → bono, etc.), identificación de qué funnels mejoraron o empeoraron, y explicaciones de variaciones por funnel, 10) Análisis de tendencias: gráficos de líneas mostrando la evolución de cada métrica a lo largo del tiempo (no solo comparación de dos períodos, sino tendencia histórica), identificación de patrones y tendencias (crecimiento constante, estacionalidad, picos y valles), y proyecciones basadas en tendencias históricas, 11) Filtros y segmentación: posibilidad de filtrar la comparativa por canal de origen, por tipo de funnel, por tipo de cliente, y por otros criterios relevantes, comparativa segmentada mostrando cómo diferentes segmentos evolucionaron entre períodos, y análisis de qué segmentos contribuyeron más a los cambios, 12) Exportación de reportes: posibilidad de exportar la comparativa en diferentes formatos (PDF, Excel) con gráficos y tablas, reportes personalizables con métricas seleccionadas, y reportes comparativos listos para presentaciones, 13) Alertas y notificaciones: notificaciones cuando hay cambios significativos en métricas clave entre períodos, alertas cuando una métrica empeora significativamente, y notificaciones de hitos positivos (ej: '¡Felicitaciones! Los clientes nuevos aumentaron 25% este mes'), 14) Integración con datos reales: conexión directa con el sistema de agenda para datos de consultas, con el sistema de pagos para datos de conversiones y valores, con el sistema de clientes para datos de clientes nuevos, y con el sistema de leads para datos de origen y atribución, 15) Dashboard consolidado: vista única que muestre todas las comparativas de forma clara y accionable, con diseño visual que facilite la identificación rápida de mejoras y empeoramientos, y navegación intuitiva entre diferentes tipos de comparativas. El sistema debe proporcionar una visión clara y accionable de cómo están evolucionando las métricas de captación, permitiendo identificar tendencias, factores de influencia, y oportunidades de mejora."
    },
    {
      "id": "US-01",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver una explicación clara y simple de qué puedo hacer en esta sección al entrar",
      "reason": "Entender rápidamente si esta sección me ayuda a resolver mis necesidades de marketing y crecimiento",
      "description": "Reemplazar el texto técnico actual por una descripción clara que explique que aquí puedo crear campañas de marketing automatizadas, probar qué mensajes funcionan mejor con mis clientes, y obtener recomendaciones inteligentes para hacer crecer mi negocio. El sistema debe incluir: 1) Descripción principal clara y accesible: reemplazar términos técnicos como 'Engagement Hub', 'Playbooks IA', 'Orquestación' por lenguaje simple y orientado al entrenador personal, explicación directa de que esta sección permite crear campañas de marketing automatizadas (email, WhatsApp, redes sociales), descripción de que se pueden probar diferentes mensajes para ver cuáles funcionan mejor con los clientes (A/B testing), y explicación de que se obtienen recomendaciones inteligentes basadas en datos para hacer crecer el negocio, 2) Ejemplos concretos y contextualizados: ejemplos específicos del sector fitness como 'crear una campaña automática de bienvenida para nuevos clientes', 'probar dos mensajes diferentes para reactivar clientes inactivos y ver cuál genera más respuestas', 'recibir recomendaciones como clientes que no han venido en 2 semanas y necesitan seguimiento', ejemplos visuales o casos de uso que muestren el valor práctico, y lenguaje que conecte con las necesidades reales del entrenador (captar clientes, retener clientes, reactivar inactivos), 3) Ubicación y diseño: la descripción debe estar visible en el header o sección principal de la página, diseño que destaque la descripción sin ser intrusivo, uso de iconos o elementos visuales que refuercen el mensaje, y tipografía y colores que faciliten la lectura rápida, 4) Eliminación de jerga técnica: reemplazar 'Playbooks IA' por 'Campañas de Marketing Automatizadas' o 'Secuencias de Mensajes', reemplazar 'Experimentos' por 'Pruebas de Mensajes' o 'Test A/B', reemplazar 'Orquestación' por 'Gestión Centralizada' o 'Centro de Marketing', reemplazar 'Engagement Hub' por 'Centro de Marketing' o 'Marketing Inteligente', y evitar términos como 'Personalización avanzada', 'Feedback loops', 'Insights' sin explicación, 5) Mensaje de valor claro: explicación de beneficios concretos como 'ahorra tiempo automatizando mensajes', 'mejora resultados probando qué funciona mejor', 'toma decisiones basadas en datos, no en suposiciones', conexión directa con objetivos del negocio (más clientes, mejor retención, mayor crecimiento), y lenguaje motivacional que inspire acción, 6) Guía rápida de inicio: indicación clara de dónde empezar (botones o enlaces destacados), sugerencias de primeras acciones (ej: 'Comienza creando tu primera campaña de bienvenida'), y enlaces a plantillas o ejemplos predefinidos, 7) Consistencia en toda la interfaz: aplicar el mismo lenguaje claro en botones, menús, tooltips y descripciones de secciones, mantener coherencia entre el header y el resto de la página, y asegurar que todos los elementos de la interfaz usen terminología accesible, 8) Feedback y mejora continua: posibilidad de obtener feedback del usuario sobre la claridad de la descripción, y ajustes basados en uso real y comprensión del usuario. El objetivo es que cualquier entrenador personal, sin conocimiento técnico previo, pueda entender inmediatamente qué puede hacer en esta sección y cómo le ayuda a hacer crecer su negocio."
    },
    {
      "id": "US-02",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver un resumen rápido de métricas importantes como campañas activas, leads generados esta semana y experimentos en curso",
      "reason": "Tener una visión rápida del estado de mi marketing sin tener que navegar por las pestañas",
      "description": "Agregar un panel de métricas resumidas en el header mostrando: número de campañas activas, leads generados en últimos 7 días, experimentos en ejecución y próxima acción recomendada, con diseño compacto y visual."
    },
    {
      "id": "US-03",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver un botón que diga Crear Campaña de Marketing en lugar de Nuevo Playbook IA",
      "reason": "Entender inmediatamente qué voy a hacer al hacer clic, sin tener que adivinar qué es un playbook",
      "description": "Cambiar el texto del botón a algo más claro como \"Crear Campaña\" o \"Nueva Campaña de Marketing\", con un tooltip o descripción corta que explique que puedo crear campañas automatizadas de email, WhatsApp, redes sociales, etc."
    },
    {
      "id": "US-04",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver un botón que diga Probar Estrategia o Test A/B en lugar de Lanzar Experimento",
      "reason": "Entender que puedo probar diferentes mensajes o enfoques para ver cuál funciona mejor con mis clientes",
      "description": "Cambiar el texto a algo más comprensible como \"Probar Mensajes\" o \"Test de Estrategias\", con explicación de que puedo enviar dos versiones diferentes y ver cuál genera más respuestas o conversiones."
    },
    {
      "id": "US-05",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver recomendaciones específicas como clientes inactivos a reactivar o mejores momentos para publicar",
      "reason": "Saber qué acciones tomar ahora mismo para mejorar mi negocio",
      "description": "Agregar una sección de recomendaciones inteligentes en el header que analice mis datos y sugiera acciones concretas con botones de acción rápida."
    },
    {
      "id": "US-06",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver un enlace rápido a mis campañas que más leads o clientes han generado",
      "reason": "Poder duplicarlas o crear variaciones rápidamente sin tener que buscar en la lista completa",
      "description": "Agregar un dropdown o sección en el header con Mis Top 3 Campañas mostrando las campañas más exitosas con métricas clave y botón para duplicar o ver detalles."
    },
    {
      "id": "US-07",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver cuántos experimentos tengo corriendo y cuáles están listos para revisar resultados",
      "reason": "No olvidarme de revisar qué estrategias funcionaron mejor y aplicar los ganadores",
      "description": "Agregar un indicador visual en el header mostrando número de experimentos activos, experimentos completados pendientes de revisión, y acceso rápido a ver resultados con badge de notificación."
    },
    {
      "id": "US-08",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver una explicación simple con ejemplos de qué es un playbook o campaña de marketing",
      "reason": "Entender que es una secuencia automatizada de mensajes que me ayuda a conseguir objetivos como captar clientes o reactivar inactivos",
      "description": "Agregar un tooltip o modal informativo accesible desde el header que explique con ejemplos concretos cómo funciona un playbook enfocado en entrenadores personales."
    },
    {
      "id": "US-09",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver un botón o enlace a plantillas predefinidas de campañas como captar clientes de Año Nuevo o reactivar inactivos",
      "reason": "Poder crear campañas rápidamente usando plantillas probadas en lugar de empezar desde cero",
      "description": "Agregar un botón Ver Plantillas o dropdown en el header que muestre las plantillas más populares para entrenadores con descripción breve y acceso directo a activarlas."
    },
    {
      "id": "US-10",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver qué campañas se van a enviar hoy o esta semana desde esta sección",
      "reason": "Tener control sobre qué mensajes van a recibir mis clientes y poder ajustar si es necesario",
      "description": "Agregar una sección Próximos Envíos en el header mostrando las próximas acciones programadas con fecha/hora y opción de pausar o editar rápidamente."
    },
    {
      "id": "US-11",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver un badge o etiqueta que diga algo como Centro de Marketing o Marketing Inteligente en lugar de Engagement Hub",
      "reason": "Entender inmediatamente que esta sección es sobre marketing y crecimiento",
      "description": "Cambiar el badge actual por texto más comprensible y orientado al entrenador, manteniendo el diseño visual pero con mensaje claro."
    },
    {
      "id": "US-12",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver notificaciones visuales si tengo campañas pausadas, errores en envíos o experimentos que terminaron y necesitan revisión",
      "reason": "No perder oportunidades o dejar problemas sin resolver",
      "description": "Agregar un sistema de alertas en el header con iconos mostrando campañas pausadas, errores de envío y experimentos completados con resultados listos, incluyendo badge con contador."
    },
    {
      "id": "US-13",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver botones de acción rápida para objetivos comunes como captar nuevos clientes, reactivar inactivos o aumentar retención",
      "reason": "Crear campañas directamente enfocadas en lo que necesito ahora sin múltiples pasos",
      "description": "Agregar botones de acción rápida en el header con los objetivos más comunes y abrir un asistente guiado para crear esa campaña específica con plantillas y sugerencias precargadas."
    },
    {
      "id": "US-14",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver un resumen visual de qué tipos de campañas o mensajes están funcionando mejor",
      "reason": "Enfocar mi tiempo y esfuerzo en las estrategias que más resultados me dan",
      "description": "Agregar un gráfico pequeño o métricas comparativas en el header mostrando qué canales y campañas generan más leads o conversiones, con acceso a ver detalles."
    },
    {
      "id": "US-15",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver una guía rápida o tutorial la primera vez que entro a esta sección",
      "reason": "Entender cómo usar todas las funcionalidades sin tener que explorar por prueba y error",
      "description": "Implementar un tour guiado o modal de bienvenida que explique las funciones principales y sea accesible desde un botón ¿Cómo funciona? en el header."
    },
    {
      "id": "US-16",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver mis objetivos de marketing del mes y el progreso hacia ellos",
      "reason": "Saber si estoy en camino de alcanzar mis metas y qué acciones tomar si no",
      "description": "Agregar una sección de objetivos en el header mostrando metas como nuevos clientes, clientes reactivados y leads generados con barra de progreso e integración con datos reales."
    },
    {
      "id": "US-17",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Tener un campo de búsqueda en el header para encontrar rápidamente una campaña o experimento específico",
      "reason": "No tener que buscar en listas largas cuando sé el nombre de lo que busco",
      "description": "Agregar un campo de búsqueda en el header que permita buscar por nombre de campaña, experimento o palabras clave, con resultados en tiempo real y acceso directo."
    },
    {
      "id": "US-18",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver un resumen de cuánto dinero he ganado o cuántos clientes he conseguido gracias a mis campañas de marketing",
      "reason": "Entender el valor real de invertir tiempo en marketing y justificar continuar usando estas herramientas",
      "description": "Agregar una métrica destacada en el header mostrando ROI estimado o clientes generados por campañas en el último mes, con comparativa respecto al mes anterior."
    },
    {
      "id": "US-19",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver insights sobre tendencias de marketing en el sector de entrenamiento personal",
      "reason": "Estar al día con qué estrategias están usando otros entrenadores exitosos y poder aplicarlas",
      "description": "Agregar un enlace o sección en el header a tendencias del sector mostrando insights agregados sobre estrategias exitosas, mejores momentos para publicar y tipos de contenido que generan más leads."
    },
    {
      "id": "US-20",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Entender cómo funciona un playbook con ejemplos concretos enfocados en entrenadores personales",
      "reason": "Comprender rápidamente qué es un playbook y cómo puede ayudarme a automatizar mis campañas de marketing",
      "description": "Agregar un tooltip o modal informativo accesible desde el header que explique con ejemplos concretos cómo funciona un playbook enfocado en entrenadores personales."
    },
    {
      "id": "US-21",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Acceder rápidamente a plantillas de campañas populares para entrenadores y activarlas directamente",
      "reason": "Crear campañas rápidamente usando plantillas probadas en lugar de empezar desde cero",
      "description": "Agregar un botón Ver Plantillas o dropdown en el header que muestre las plantillas más populares para entrenadores con descripción breve y acceso directo a activarlas."
    },
    {
      "id": "US-23",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Sistema que detecta momentos ideales (cliente alcanza objetivo, completa programa, da feedback positivo, cumple X sesiones) y sugiere solicitar testimonio",
      "reason": "No perder oportunidades de recopilar testimonios en los momentos más propicios cuando el cliente está más satisfecho",
      "description": "Sistema que detecta momentos ideales (cliente alcanza objetivo, completa programa, da feedback positivo, cumple X sesiones) y sugiere solicitar testimonio. Notificación in-app y opción de enviar recordatorio automático al cliente."
    },
    {
      "id": "US-24",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Encuesta automática que se envía 2-4 horas después de cada sesión por WhatsApp o email",
      "reason": "Obtener feedback inmediato después de cada sesión y detectar problemas a tiempo antes de que afecten la satisfacción del cliente",
      "description": "Encuesta automática que se envía 2-4 horas después de cada sesión por WhatsApp o email. Pregunta simple de satisfacción (1-5 estrellas) y opcional comentario. Resultados se muestran en dashboard y alerta si hay feedback negativo."
    },
    {
      "id": "US-25",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Usar plantillas de mensajes para diferentes tipos de feedback negativo",
      "reason": "Responder de forma profesional y constructiva rápidamente, con sugerencias de próximos pasos según el tipo de problema",
      "description": "Plantillas de mensajes para diferentes tipos de feedback negativo: insatisfacción con sesión, progreso lento, problemas de comunicación, etc. Personalizables antes de enviar. Sugerencias de próximos pasos según el tipo de problema."
    },
    {
      "id": "US-26",
      "feature": "src/features/ComunidadYFidelizacion",
      "persona": "Entrenador personal",
      "goal": "Ver el historial completo de feedback y testimonios de cada cliente con evolución de satisfacción",
      "reason": "Identificar tendencias, mejoras o problemas recurrentes para tomar decisiones informadas sobre cada cliente",
      "description": "Sección en el perfil del cliente mostrando todos los feedbacks y testimonios históricos: fechas, puntuaciones, comentarios, tendencia (mejorando/empeorando). Gráfico de evolución de satisfacción a lo largo del tiempo."
    },
    {
      "id": "US-27",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver las próximas acciones programadas con fecha/hora y opción de pausar o editar rápidamente",
      "reason": "Tener visibilidad inmediata de lo que está programado y poder gestionarlo rápidamente sin navegar a otras secciones",
      "description": "Agregar una sección Próximos Envíos en el header mostrando las próximas acciones programadas con fecha/hora y opción de pausar o editar rápidamente."
    },
    {
      "id": "US-28",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Entender rápidamente qué es esta sección con un mensaje claro y orientado al entrenador",
      "reason": "El badge actual 'Engagement Hub' no es comprensible para un entrenador personal, necesita un mensaje más claro sobre qué hace esta sección",
      "description": "Cambiar el badge actual por texto más comprensible y orientado al entrenador, manteniendo el diseño visual pero con mensaje claro."
    },
    {
      "id": "US-29",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver alertas visuales en el header con iconos mostrando campañas pausadas, errores de envío y experimentos completados con resultados listos, incluyendo badge con contador",
      "reason": "Identificar rápidamente problemas que requieren atención inmediata y oportunidades de revisar resultados sin tener que buscar en diferentes secciones",
      "description": "Agregar un sistema de alertas en el header con iconos mostrando campañas pausadas, errores de envío y experimentos completados con resultados listos, incluyendo badge con contador. Cada icono debe ser clickeable para acceder directamente a la sección correspondiente o ver detalles en un dropdown."
    },
    {
      "id": "US-30",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Acceder rápidamente a botones de acción rápida en el header con los objetivos más comunes y abrir un asistente guiado para crear esa campaña específica con plantillas y sugerencias precargadas",
      "reason": "Crear campañas comunes de forma rápida y guiada sin tener que navegar por múltiples pantallas o recordar todos los pasos necesarios",
      "description": "Agregar botones de acción rápida en el header con los objetivos más comunes (ej: recordatorio de sesión, bienvenida nuevo cliente, seguimiento de ausencia, recordatorio de pago) y abrir un asistente guiado para crear esa campaña específica con plantillas y sugerencias precargadas adaptadas al objetivo seleccionado."
    },
    {
      "id": "US-31",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Ver un gráfico pequeño o métricas comparativas en el header mostrando qué canales y campañas generan más leads o conversiones, con acceso a ver detalles",
      "reason": "Identificar rápidamente qué canales y campañas están funcionando mejor para tomar decisiones informadas sobre dónde enfocar los esfuerzos sin tener que navegar a otras secciones",
      "description": "Agregar un gráfico pequeño o métricas comparativas en el header del módulo InteligenciaIaExperimentacion mostrando qué canales y campañas generan más leads o conversiones. El componente debe ser compacto y visual, mostrando los top 3-5 canales/campañas con sus métricas principales. Debe incluir un botón o enlace para acceder a una vista detallada con más información y análisis completo."
    },
    {
      "id": "US-32",
      "feature": "src/features/InteligenciaIaExperimentacion",
      "persona": "Entrenador personal",
      "goal": "Acceder a un tour guiado o modal de bienvenida que explique las funciones principales del módulo desde un botón '¿Cómo funciona?' en el header",
      "reason": "Entender rápidamente cómo usar todas las funcionalidades del módulo sin tener que explorar manualmente o leer documentación externa, especialmente al usar el módulo por primera vez",
      "description": "Implementar un tour guiado o modal de bienvenida que explique las funciones principales del módulo InteligenciaIaExperimentacion. El tour debe ser accesible desde un botón '¿Cómo funciona?' en el header. El modal debe incluir explicaciones visuales de las secciones principales (Overview Hub, Playbooks IA, Feedback Inteligente, Personalización IA, Test de Estrategias, Insights & Mercado), cómo crear playbooks, lanzar experimentos, y las funcionalidades clave. Debe ser interactivo, permitiendo navegar entre pasos y cerrarse en cualquier momento."
    }
  ]
}

